Repository: html5rocks/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Efficient server side storage and retrieval of key/value data
ru: Эффективное хранилище данных на стороне сервера и получение данных "ключ/значение"

source: Web workers
ru: Объекты Web Worker

source: Run JavaScript in the background, in parallel with the main window
ru: Запуск JavaScript в фоновом режиме параллельно с главным окном

source: Web sockets
ru: Веб-сокеты

source: Efficient bi-directional streaming communication
ru: Эффективный двунаправленный потоковый обмен данными

source: Local storage
ru: Локальное хранилище

source: Client side key/value data storage
ru: Хранилище данных по схеме "ключ/значение" на стороне клиента

source: Indexed database
ru: Индексированная база данных

source: Client side simple object storage
ru: Простое хранилище объектов на стороне клиента

source: App cache
ru: Кэш приложений

source: Caching web app assets locally for offline use
ru: Локальное кэширование содержимого веб-приложения для использования в автономном режиме

source: CSS3 transitions and animations
ru: Переходы и анимация CSS3

source: Native (and possibly hardware accelerated) property changes for elements
ru: Встроенные (а также, возможно, на базе аппаратного ускорения) средства изменения свойств элементов

source: CSS sprites
ru: Спрайты CSS

source: Combining many small images into one image, reduce downloads
ru: Объединение нескольких маленьких изображений в одно большое, снижение количества загрузок

source: Link prefetching
ru: Предварительная выборка ссылок

source: Ask the browser to download other pages in the background
ru: Настройте браузер для загрузки других страниц в фоновом режиме

source: Run native code (C/C++) in a browser sandbox
ru: Выполнение собственного кода (на C или C++) в тестовой среде браузера

source: HTTP persistent connections
ru: Постоянные HTTP-соединения

source: send multiple resources over the same connection
ru: отправить несколько ресурсов по одному соединению

source: Web fonts
ru: Веб-шрифты

source: natively render text instead of download images
ru: визуализация текста в исходном формате вместо загрузки изображений

source: Data URI
ru: URI данных

source: Embed binary data such as images into HTML, reducing HTTP requests
ru: Встраивание двоичных данных (например, изображений) в HTML-код для уменьшения количества HTTP-запросов

source: HTTP Caching
ru: Кэширование HTTP

source: Use If-Modified-Since and ETags to reduce content over the wire.
ru: Уменьшение объема передаваемого через Интернет трафика с помощью заголовков If-Modified-Since и ETags.

source: Data caching
ru: Кэширование данных

source: Use systems like Memcache for frequently accessed data.
ru: Применение систем, таких как Memcache, для работы с часто используемыми данными.

source: Local data caching
ru: Локальное кэширование данных

source: Put data on the client for faster access.
ru: Хранение данных на стороне клиента для ускорения доступа.

source: Content delivery networks
ru: Сети для передачи содержания

source: Place the content closer to the client with a CDN.
ru: Сокращение расстояния между содержанием и клиентом с помощью CDN.

source: Efficient data retrieval
ru: Эффективное извлечение данных

source: Minimize SQL calls, reduce joins, retrieve via an index.
ru: Уменьшение количества SQL-запросов и соединений, получение данных по индексу.

source: Pre-calculating results
ru: Предварительный расчет результатов

source: Denormalize or pre-calculate frequently retrieved data.
ru: Денормализация и предварительный расчет для часто извлекаемых данных.

source: Minification
ru: Уменьшение размера

source: Shrink your JavaScript, CSS, and even HTML files.
ru: Сжимайте код JavaScript, CSS и даже HTML-файлы.

source: Compression
ru: Сжатие

source: Compress your assets via HTTP's Accept-Encoding.
ru: Уменьшение объема данных с помощью поля Accept-Encoding в HTTP-запросе.

source: Asynchronous callbacks
ru: Асинхронные обратные вызовы

source: Defer the work, get notified when it&rsquo;s done.
ru: Поставьте задачу и дождитесь уведомления о ее завершении.

source: Hardware acceleration
ru: Аппаратное ускорение

source: Browsers are now using the GPU for things like canvas and transforms.
ru: Графический процессор в настоящее время используется в браузерах для таких объектов, как элемент canvas и преобразования.

source: Moving calculations close to data
ru: Более точные расчеты на основе данных

source: Data is bigger than algorithms, move code and not data.
ru: Размер данных превышает размер алгоритмов. Перемещайте не данные, а код.

source: Profiling
ru: Профилирование

source: Use tools to understand and collect real life data. Measure, don&rsquo;t guess.
ru: Используйте инструменты для сбора и анализа реальных данных, чтобы принимать обоснованные решения.

source: Sprites
ru: Спрайты

source: Place many images into one file, minimizing HTTP requests.
ru: Объедините несколько изображений в одном файле, уменьшив количество HTTP-запросов.

source: Image optimization
ru: Оптимизация изображений

source: Compress your images, pick the right format for the job.
ru: Сжатие изображений и выбор подходящего формата для текущего задания.

source: Specify image width and heights
ru: Укажите ширину и высоту изображения

source: Tell the browser how to render around images before they are downloaded.
ru: Настройка вывода изображений в браузере до их загрузки.

source: Place JavaScript at the bottom of your HTML
ru: Расположите JavaScript в нижней части HTML-кода

source: Let the page download and begin rendering.
ru: Дождитесь загрузки страницы и приступайте к ее выводу на экран.

source: Rendering on the client
ru: Отображение на стороне клиента

source: Use canvas to draw images, or web fonts to render text, instead of downloading assets.
ru: Используйте элемент canvas для рисования картинок или веб-шрифты для вывода текста вместо загрузки объектов.

source: Read 'High Performance Web Sites' and 'Even Faster Web Sites'
ru: Ознакомьтесь со статьями "Высокопроизводительные веб-сайты" и "Еще более быстрые веб-сайты"

source: Covers web app performance in great detail
ru: Подробно рассматривается производительность веб-приложений

source: Developer tools for <a href="http://www.chromium.org/devtools">Chrome</a> and <a href="http://developer.apple.com/technologies/safari/developer-tools.html">Safari</a>
ru: Инструменты разработчика для <a href="http://www.chromium.org/devtools">Chrome</a> и <a href="http://developer.apple.com/technologies/safari/developer-tools.html">Safari</a>

source: Peer into requests, walk the DOM, set JavaScript breakpoints, get behind the scenes
ru: Анализируйте запросы и модель DOM, задавайте точки останова JavaScript и управляйте работой своего кода

source: <a href="http://www.opera.com/dragonfly/">Dragonfly</a> for Opera
ru: <a href="http://www.opera.com/dragonfly/">Dragonfly</a> для Opera

source: Similar to Webkit Developer Tools, but for Opera
ru: Как Инструменты разработчика Webkit, но для Opera

source: <a href="http://getfirebug.com/">Firebug</a> for Firefox
ru: <a href="http://getfirebug.com/">Firebug</a> для Firefox

source: Similar to Opera Dragonfly, but for Firefox.
ru: Как Opera Dragonfly, но для Firefox.

source: <a href="http://www.html5rocks.com/tutorials/developertools/auditpanel/">Audit panel</a> in the Developer tools
ru: <a href="http://www.html5rocks.com/tutorials/developertools/auditpanel/">Панель аудита</a> Инструментов разработчика

source: Get suggestions for speeding up your web app
ru: Предложения по ускорению работы веб-приложения

source: <a href="http://code.google.com/webtoolkit/speedtracer/">Speedtracer</a> - not just for GWT, check out the <a href="http://www.igvita.com/2010/07/19/speed-tracer-server-side-tracing-with-rack/">Ruby plugin</a>
ru: Расширение <a href="http://code.google.com/webtoolkit/speedtracer/">Speedtracer</a> предназначено не только для GWT: информацию можно найти в статье <a href="http://www.igvita.com/2010/07/19/speed-tracer-server-side-tracing-with-rack/">Подключаемый модуль Ruby</a>

source: Identify and fix performance problems in your web app
ru: Обнаружение и устранение проблем с производительностью веб-приложения

source: <a href="http://developer.yahoo.com/yslow/">YSlow</a> for Firebug
ru: <a href="http://developer.yahoo.com/yslow/">YSlow</a> для Firebug

source: Like the Developer Tools' Audit Panel, but for Firefox
ru: Как панель аудита Инструментов разработчика, но для Firefox

source: <a href="http://code.google.com/closure/compiler/">Closure JavaScript compiler</a>
ru: <a href="http://code.google.com/closure/compiler/">Компилятор Closure JavaScript</a>

source: Minify, reduce, and obfuscate your JavaScript
ru: Уменьшение размера и скрытие кода JavaScript

source: Minify and obfuscate your JavaScript and CSS
ru: Уменьшение размера и скрытие кода JavaScript и CSS

source: An industry collaboration providing the testing infrastructure for testing from around the globe
ru: Созданная на базе отраслевого сотрудничества инфраструктура тестирования для общего использования

source: With the introduction of CSS3 it has never been easier to create rich and beautiful sites and applications in HTML. There are many new technologies and extensions to CSS3 including: <a href="http://www.w3.org/TR/css3-2d-transforms">2D Transformations</a>, <a href="http://www.w3.org/TR/css3-transistion">Transitions</a>, <a href="http://www.w3.org/TR/css3-3d-transforms">3D Transforms</a> and <a href="http://www.w3.org/TR/css3-webfonts">WebFonts</a> to name just a few.
ru: С появлением CSS3 задача создания полнофункциональных и хорошо оформленных сайтов и приложений на языке HTML существенно упростилась. Эта технология поддерживает целый ряд новых функций и расширений, в том числе <a href="http://www.w3.org/TR/css3-2d-transforms">двумерные преобразования</a>, <a href="http://www.w3.org/TR/css3-transistion">переходы</a>, <a href="http://www.w3.org/TR/css3-3d-transforms">трехмерные преобразования</a>, <a href="http://www.w3.org/TR/css3-webfonts">веб-шрифты</a> и многое другое.

source: You can create rich user experiences with no coding effort required, just simply apply a little CSS to your existing applications.
ru: Создать качественный пользовательский интерфейс можно и без программирования: достаточно встроить таблицы CSS в существующие приложения.

source: CSS3 Transformations allow you to apply rotations, scales, skews and translations to any DOM element with simple styles.
ru: Преобразования CSS3 позволяют применять эффекты поворота, масштабирования, перекоса и перевода к любому элементу модели DOM с помощью простых стилей.

source: Transitions allow you to specify how the style on a DOM element will animate between transformed states. For example, you can animate the background color when the user hovers over an element. <strong>Hover over this code!</strong>
ru: С помощью переходов можно определить, как будет изменяться стиль элемента DOM. Например, цвет фона может меняться, когда пользователь наводит указатель мыши на элемент. <strong>Наведите указатель на этот блок кода.</strong>

source: Applying 3D transforms is simple too. Just specify the transformation in 3d co-ordinates and you are ready. <strong>Hover over this code!</strong>
ru: Трехмерное преобразование тоже дается очень легко: достаточно указать его координаты в трех измерениях. <strong>Наведите указатель мыши на этот код.</strong>

source: A list of the current status of the CSS3 specifications.
ru: Список текущего статуса спецификаций CSS3.

source: This W3C specification defines the new selectors available to developers.
ru: В этой спецификации W3C определяются новые селекторы, доступные разработчикам.

source: This W3C specification defines how rotations, transformations, skews and scaling should be applied to DOM elements in 2 dimensions.
ru: Эта спецификация W3C определяет, как применять эффекты поворота, преобразования, перекоса и масштабирования к элементам DOM в двух измерениях.

source: This W3C specification defines how 3d transformations should be applied to DOM elements.
ru: В этой спецификации W3C определяется порядок применения трехмерных преобразований к элементам DOM.

source: This W3C specification defines how properties should be animated between states.
ru: В этой спецификации W3C определяется, как происходит анимация свойств между их состояниями.

source: This W3C specification defines the new animation properties available.
ru: В этой спецификации W3C определяются новые доступные свойства анимации.

source: Semantics is one of the most distinctive features of the Web Platform versus other application platforms. Developers usually ignore or de-prioritize such feature but the mastery of it can bring many benefits to our projects.
ru: Семантика является одной из отличительных характеристик веб-платформы по сравнению с другими программными платформами. Разработчики обычно не уделяют ей должного внимания или и вовсе игнорируют ее, однако освоение семантики сулит множество дополнительных преимуществ.

source: The Web is text and text has a meaning. Ultimately the content that our browsers read is pure text. Web sites and web applications have been created in an ecosystem where text based content is linkable, searchable and mashable. In the open web scenario our content can be shown, fed and remixed by third parties, search engines and accessibility tools. All these benefits don't come for free. Automated tools can only do half of the job at recognizing the nature of the content. The better job the developer does at marking the right semantics of the content the easier will be for the rest of the agents to deal with it. HTML5 provides a series of tools to make developers life easier too:
ru: Интернет по своей природе является текстом, а у каждого текста есть значение. В конечном счете содержание, обрабатываемое браузерами, является чистым текстом. Веб-сайты и веб-приложения разрабатываются в системе, где текстовое содержание связано ссылками, доступно для поиска и совместимо с различным ПО. В открытом веб-сценарии наши материалы отображаются, подаются и редактируются третьими лицами, поисковыми системами и инструментами публикации. Все перечисленные преимущества требуют приложения дополнительных усилий. Автоматизированные инструменты могут выполнить лишь часть работы, связанной с определением природы содержания. И чем лучше разработчик разметит правильную семантику материалов, тем проще остальным агентам с ним взаимодействовать. Ниже перечислены инструменты, которыми HTML5 обеспечивает веб-разработчиков, тем самым облегчая их работу.

source: New media elements.
ru: Новые мультимедийные элементы

source: New structural elements.
ru: Новые структурные элементы

source: New semantics for internationalization.
ru: Новая семантика для интернационализации

source: New link relation types.
ru: Новые типы взаимосвязей ссылок

source: New attributes.
ru: Новые атрибуты

source: New form types.
ru: Новые типы форм

source: New microdata syntax for additional semantics.
ru: Новый синтаксис микроданных открывает дополнительные возможности для построения фраз.

source: To enable sectioning markup in old IE.
ru: Включение разметки разделов в старых версиях IE.

source: When web developers think of storing anything about the user, they immediately think of uploading to the server. HTML5 changes that, as there are now several technologies allowing the app to save data on the client device. It might also be sync'd back to the server, or it might only ever stay on the client: that's down to you, the developer.
ru: Веб-разработчики в первую очередь связывают хранение пользовательских данных с их загрузкой на сервер. HTML5 меняет это представление, поскольку сегодня есть несколько технологий, позволяющих хранить данные на клиентском устройстве. В зависимости от желания разработчика данные можно синхронизировать обратно на сервер или постоянно хранить на клиенте.

source: There are several reasons to use client-side storage. First, you can make your app work when the user is offline, possibly sync'ing data back once the network is connected again. Second, it's a performance booster; you can show a large corpus of data as soon as the user clicks on to your site, instead of waiting for it to download again. Third, it's an easier programming model, with no server infrastructure required. Of course, the data is more vulnerable and the user can't access it from multiple clients, so you should only use it for non-critical data, in particular cached versions of data that's also "in the cloud". See <a href="/tutorials/offline/whats-offline/">"Offline": What does it mean and why should I care?</a> for a general discussion of offline technologies, of which client-side storage is one component.
ru: Есть несколько причин, по которым стоит использовать систему хранения клиента. Во-первых, таким образом можно организовать работу приложения в автономном режиме с последующей обратной синхронизацией данных после повторного подключения к сети. Во-вторых, повышается эффективность: при возврате на сайт пользователю не нужно ждать повторной загрузки большого набора данных – их можно показать сразу. В-третьих, благодаря отсутствию серверной инфраструктуры упрощается программирование. Разумеется, в этом случае данные оказываются более уязвимыми и пользователь не может обращаться к ним из нескольких клиентов, поэтому такую модель следует использовать только для некритичных данных (например, кэшированных данных, которые дублируются "в облаке"). Обсуждение общих вопросов использования автономных технологий, к которым относится и локальная файловая система клиента, можно найти в статье о <a href="/tutorials/offline/whats-offline/">важности и значении автономного режима</a>.

source: While Web SQL Database is supported in Chrome, Safari &amp; Opera, Firefox and IE are unlikely to support it any time soon (Mozilla is <a href="http://hacks.mozilla.org/2010/06/beyond-html5-database-apis-and-the-road-to-indexeddb/">philosophically opposed</a>). Indexed Database has an early implementation in Firefox 4.0 Beta and Chrome dev channel. There's a good chance all browsers will support it in the future, but that's not yet clear.
ru: Хотя веб-базы данных SQL поддерживаются в браузерах Chrome, Safari и Opera, в ближайшее время вряд ли будет обеспечена их поддержка для браузеров Firefox и Internet Explorer (это противоречит <a href="http://hacks.mozilla.org/2010/06/beyond-html5-database-apis-and-the-road-to-indexeddb/">концепции</a> компании Mozilla). Индексированные базы данных были реализованы уже в бета-версии Firefox 4.0 и на канале разработчиков Chrome. Вполне возможно, что в будущем они будут поддерживаться всеми браузерами, однако это пока не очевидно.

source: <a href="http://dev.w3.org/html5/webstorage/">Web Storage</a> simply provides a key-value mapping, e.g. <code>localStorage["name"] = username;</code>. Unfortunately, present implementations only support string-to-string mappings, so you need to serialise and de-serialise other data structures. You can do so using <code>JSON.stringify()</code> and <code>JSON.parse()</code>.
ru: В <a href="http://dev.w3.org/html5/webstorage/">веб-хранилище</a> реализовано простое сопоставление ключей и значений, например <code>localStorage["имя"] = имя_пользователя;</code>. К сожалению, в настоящее время поддерживаются только сопоставления типа "строка-строка", поэтому для других структур данных необходимы сериализация и десериализация (например, с помощью методов <code>JSON.stringify()</code> и <code>JSON.parse()</code>).

source: <a href="http://dev.w3.org/html5/webdatabase/">Web SQL Database</a> gives you all the power - and effort - of a structured SQL relational database.
ru: <a href="http://dev.w3.org/html5/webdatabase/">Веб-база данных SQL</a> поддерживает все возможности и функции структурированной реляционной базы данных SQL.

source: <a href="http://www.w3.org/TR/IndexedDB/">Indexed Database</a> is somewhere in between Web Storage and Web SQL Database. Like Web Storage, it's a straightforward key-value mapping, but it supports indexes like those of relational databases, so searching objects matching a particular field is fast; you don't have to manually iterate through every object in the store.
ru: <a href="http://www.w3.org/TR/IndexedDB/">Индексированная база данных</a> – нечто среднее между веб-хранилищем и веб-базой данных SQL. Как и в веб-хранилище, в ней напрямую сопоставляются ключи и значения, но также поддерживаются индексы, как в реляционных базах данных. Это позволяет осуществлять быстрый поиск объектов, соответствующих конкретному полю: перебирать все объекты в хранилище вручную не нужно.

source: <a href="http://www.w3.org/TR/FileAPI/">File Access</a> is an API for reading file content in JavaScript. Given a set of files the user has added to a "file" input element, you can read the content of the file or reference it as a URL, e.g. if the user has specified an image file, you can show the image. There are also proposals underway for file writing capabilities.
ru: <a href="http://www.w3.org/TR/FileAPI/">API доступа к файлам</a> – это интерфейс JavaScript для чтения файлов. На базе набора файлов, добавленных пользователем во входной элемент файла, можно прочитать его содержание или создать ссылку на него в виде URL (например, если пользователь указал изображение, его можно вывести на экран). Также разрабатываются предложения по реализации записи файлов.

source: For a detailed comparison of client-side storage techniques with code demos, see our <a href="/tutorials/offline/storage/">Client-Side Storage</a> article.
ru: Подробное сравнение технологий хранения данных на стороне клиента с примерами кода можно найти в статье <a href="/tutorials/offline/storage/">Хранение данных на стороне клиента</a>.

source: Mark Pilgrim dives into using the storage APIs.
ru: Марк Пилгрим (Mark Pilgrim) подробно рассматривает использование API хранилища.

source: Mozilla Developer Center on Web Storage.
ru: Сведения о веб-хранилище в Центре разработчиков Mozilla.

source: Mozilla Developer Center on IndexedDB.
ru: Сведения об индексированных базах данных в Центре разработчиков Mozilla.

source: Creating a todo list manager using localStorage, app cache and offline events.
ru: Создание диспетчера списка задач с использованием локального хранилища localStorage, кэша приложений и событий в автономном режиме.

source: Mozilla explains its views on Web SQL Database and Indexed Database
ru: Представители Mozilla объясняют свой подход к веб-базам данных SQL и индексированным базам данных

source: Frameworks
ru: Платформы

source: Development Tools
ru: Инструменты разработчиков

source: Compatibility
ru: Совместимость

source: Inspiration
ru: Вдохновляющие идеи

source: Posts & Tutorials
ru: Статьи и руководства

source: Filtering by tag
ru: Фильтрация по тегам

source: [Clear filter]
ru: [Очистить фильтр]

source: Null character in input stream, replaced with U+FFFD.
ru: Нулевой символ во входном потоке, который заменяется на U+FFFD.

source: Invalid codepoint in stream.
ru: Недопустимый элемент кода в потоке.

source: Solidus (/) incorrectly placed in tag.
ru: Недопустимая косая черта (/) в теге.

source: Incorrect CR newline entity, replaced with LF.
ru: Неправильный объект новой строки CR. Заменено на LF.

source: Entity used with illegal number (windows-1252 reference).
ru: Использован объект с недопустимым номером (ссылка в кодировке Windows-1252).

source: Numeric entity couldn't be converted to character (codepoint U+%(charAsInt)08x).
ru: Не удалось преобразовать числовой объект в символ (элемент кода U+%(charAsInt)08x).

source: Numeric entity represents an illegal codepoint: U+%(charAsInt)08x.
ru: Числовой объект представляет недопустимый элемент кода: U+%(charAsInt)08x.

source: Numeric entity didn't end with ';'.
ru: Числовой объект не завершается символом ";".
