Repository: html5rocks/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Numeric entity expected. Got end of file instead.
ru: Ожидается числовой объект. Вместо него получен конец файла.

source: Numeric entity expected but none found.
ru: Не обнаружен ожидаемый числовой объект.

source: Named entity didn't end with ';'.
ru: Именованный объект не завершается символом ";".

source: Named entity expected. Got none.
ru: Ожидаемый именованный объект не получен.

source: End tag contains unexpected attributes.
ru: Конечный тег содержит неожиданные атрибуты.

source: Expected tag name. Got '>' instead.
ru: Ожидается название тега. Вместо него получен элемент ">".

source: Expected tag name. Got '?' instead. (HTML doesn't support processing instructions.)
ru: Ожидается название тега. Вместо него получен элемент "?". (В HTML не поддерживается обработка инструкций.)

source: Expected tag name. Got something else instead
ru: Ожидается название тега. Получен другой элемент.

source: Expected closing tag. Got '>' instead. Ignoring '</>'.
ru: Ожидается закрывающий тег. Вместо него получен элемент ">". Элемент "</>" игнорируется.

source: Expected closing tag. Unexpected end of file.
ru: Ожидается закрывающий тег. Неожиданный конец файла.

source: Expected closing tag. Unexpected character '%(data)s' found.
ru: Ожидается закрывающий тег. Обнаружен неожиданный символ "%(data)s".

source: Unexpected end of file in the tag name.
ru: Неожиданный конец файла в названии тега.

source: Unexpected end of file. Expected attribute name instead.
ru: Неожиданный конец файла. Вместо этого ожидается название атрибута.

source: Unexpected end of file in attribute name.
ru: Неожиданный конец файла в названии атрибута.

source: Invalid chracter in attribute name
ru: Недопустимый символ в названии атрибута

source: Dropped duplicate attribute on tag.
ru: В тег добавлен повторяющийся атрибут.

source: Unexpected end of file. Expected = or end of tag.
ru: Неожиданный конец файла. Ожидается элемент = или конец тега.

source: Unexpected end of file. Expected attribute value.
ru: Неожиданный конец файла. Ожидается значение атрибута.

source: Expected attribute value. Got '>' instead.
ru: Ожидается значение атрибута. Вместо него получен элемент ">".

source: Unexpected end of file in attribute value (").
ru: Неожиданный конец файла в значении атрибута (").

source: Unexpected end of file in attribute value (').
ru: Неожиданный конец файла в значении атрибута (').

source: Unexpected end of file in attribute value.
ru: Неожиданный конец файла в значении атрибута.

source: Unexpected end of file in tag. Expected >
ru: Неожиданный конец файла в теге. Ожидается элемент ">".

source: Unexpected character after / in tag. Expected >
ru: Неожиданный символ после / в теге. Ожидается элемент ">".

source: Expected '--' or 'DOCTYPE'. Not found.
ru: Ожидается элемент "--" или "DOCTYPE". Нужный элемент не обнаружен.

source: Incorrect comment.
ru: Неправильный комментарий.

source: Unexpected end of file in comment.
ru: Неожиданный конец файла в комментарии.

source: Unexpected end of file in comment (-)
ru: Неожиданный конец файла в комментарии (-)

source: Unexpected '-' after '--' found in comment.
ru: В комментарии обнаружен неожиданный элемент "-" после "--".

source: Unexpected end of file in comment (--).
ru: Неожиданный конец файла в комментарии (--).

source: Unexpected character in comment found.
ru: Обнаружен неожиданный символ в комментарии.

source: No space after literal string 'DOCTYPE'.
ru: Нет пробела после строкового литерала DOCTYPE.

source: Unexpected > character. Expected DOCTYPE name.
ru: Неожиданный символ >. Ожидается название DOCTYPE.

source: Unexpected end of file. Expected DOCTYPE name.
ru: Неожиданный конец файла. Ожидается название DOCTYPE.

source: Unexpected end of file in DOCTYPE name.
ru: Неожиданный конец файла в названии DOCTYPE.

source: Unexpected end of file in DOCTYPE.
ru: Неожиданный конец файла в элементе DOCTYPE.

source: Expected space or '>'. Got '%(data)s'
ru: Ожидается пробел или ">". Получен элемент "%(data)s"

source: Unexpected end of DOCTYPE.
ru: Неожиданный конец элемента DOCTYPE.

source: Unexpected character in DOCTYPE.
ru: Неожиданный символ в элементе DOCTYPE.

source: Unexpected DOCTYPE. Ignored.
ru: Неожиданный элемент DOCTYPE. Игнорируется.

source: html needs to be the first start tag.
ru: Первым начальным тегом должен быть HTML.

source: Unexpected End of file. Expected DOCTYPE.
ru: Неожиданный конец файла. Ожидается элемент DOCTYPE.

source: Erroneous DOCTYPE.
ru: Ошибочный элемент DOCTYPE.

source: Unexpected non-space characters. Expected DOCTYPE.
ru: Неожиданные символы, не являющиеся пробелами. Ожидается элемент DOCTYPE.

source: Unexpected start tag (%(name)s). Expected DOCTYPE.
ru: Неожиданный начальный тег (%(name)s). Ожидается элемент DOCTYPE.

source: Unexpected end tag (%(name)s). Expected DOCTYPE.
ru: Неожиданный конечный тег (%(name)s). Ожидается элемент DOCTYPE.

source: Unexpected end tag (%(name)s) after the (implied) root element.
ru: Неожиданный конечный тег (%(name)s) после подразумеваемого корневого элемента.

source: Unexpected end of file. Expected end tag (%(name)s).
ru: Неожиданный конец файла. Ожидается конечный тег (%(name)s).

source: Unexpected start tag head in existing head. Ignored.
ru: Неожиданный заголовок начального тега в существующем заголовке. Игнорируется.

source: Unexpected end tag (%(name)s). Ignored.
ru: Неожиданный конечный тег (%(name)s). Игнорируется.

source: Unexpected start tag (%(name)s) that can be in head. Moved.
ru: Неожиданный начальный тег (%(name)s), который может располагаться в заголовке. Элемент перемещен.

source: Unexpected start tag (%(name)s).
ru: Неожиданный начальный тег (%(name)s).

source: Missing end tag (%(name)s).
ru: Отсутствует конечный тег (%(name)s).

source: Missing end tags (%(name)s).
ru: Отсутствуют закрывающие теги (%(name)s).

source: Unexpected start tag (%(startName)s) implies end tag (%(endName)s).
ru: Неожиданный начальный тег (%(startName)s) подразумевает конечный тег (%(endName)s).

source: Unexpected start tag (%(originalName)s). Treated as %(newName)s.
ru: Неожиданный начальный тег (%(originalName)s). Рассматривается как %(newName)s.

source: Unexpected start tag %(name)s. Don't use it!
ru: Неожиданный начальный тег %(name)s. Не используйте его.

source: Unexpected start tag %(name)s. Ignored.
ru: Неожиданный начальный тег %(name)s. Игнорируется.

source: Unexpected end tag (%(gotName)s). Missing end tag (%(expectedName)s).
ru: Неожиданный конечный тег (%(gotName)s). Нет конечного тега (%(expectedName)s).

source: End tag (%(name)s) seen too early. Expected other end tag.
ru: Конечный тег (%(name)s) встречается слишком рано. Ожидается другой конечный тег.

source: Unexpected end tag (%(gotName)s). Expected end tag (%(expectedName)s).
ru: Неожиданный конечный тег %(gotName)s. Ожидается конечный тег %(expectedName)s.

source: End tag (%(name)s) seen too early. Ignored.
ru: Конечный тег (%(name)s) встречается слишком рано. Игнорируется.

source: End tag (%(name)s) violates step 1, paragraph 1 of the adoption agency algorithm.
ru: В конечном теге (%(name)s) нарушены требования шага 1 (п. 1) алгоритма "усыновления".

source: End tag (%(name)s) violates step 1, paragraph 2 of the adoption agency algorithm.
ru: В конечном теге (%(name)s) нарушены требования шага 1 (п. 2) алгоритма "усыновления".

source: End tag (%(name)s) violates step 1, paragraph 3 of the adoption agency algorithm.
ru: В конечном теге (%(name)s) нарушены требования шага 1 (п. 3) алгоритма "усыновления".

source: Unexpected end tag (%(originalName)s). Treated as %(newName)s.
ru: Неожиданный конечный тег (%(originalName)s). Рассматривается как %(newName)s.

source: This element (%(name)s) has no end tag.
ru: Этот элемент (%(name)s) не имеет конечного тега.

source: Unexpected implied end tag (%(name)s) in the table phase.
ru: Неожиданный подразумеваемый конечный тег (%(name)s) в фазе таблицы.

source: Unexpected implied end tag (%(name)s) in the table body phase.
ru: Неожиданный подразумеваемый конечный тег (%(name)s) в фазе тела таблицы.

source: Unexpected non-space characters in table context caused voodoo mode.
ru: Неожиданные символы, не являющиеся пробелами, в контексте таблицы привели к переходу в "режим зомби".

source: Unexpected input with type hidden in table context.
ru: Неожиданные входные данные с типом, скрытым в контексте таблицы.

source: Unexpected form in table context.
ru: Неожиданная форма в контексте таблицы.

source: Unexpected start tag (%(name)s) in table context caused voodoo mode.
ru: Неожиданный начальный тег (%(name)s) в контексте таблицы привел к переходу в "режим зомби".

source: Unexpected end tag (%(name)s) in table context caused voodoo mode.
ru: Неожиданный конечный тег (%(name)s) в контексте таблицы привел к переходу в "режим зомби".

source: Unexpected table cell start tag (%(name)s) in the table body phase.
ru: Неожиданный начальный тег ячейки таблицы (%(name)s) в фазе тела таблицы.

source: Got table cell end tag (%(name)s) while required end tags are missing.
ru: Получен конечный тег ячейки таблицы (%(name)s), но отсутствуют требуемые конечные теги.

source: Unexpected end tag (%(name)s) in the table body phase. Ignored.
ru: Неожиданный конечный тег (%(name)s) в фазе тела таблицы. Игнорируется.

source: Unexpected implied end tag (%(name)s) in the table row phase.
ru: Неожиданный подразумеваемый конечный тег (%(name)s) в фазе строки таблицы.

source: Unexpected end tag (%(name)s) in the table row phase. Ignored.
ru: Неожиданный конечный тег (%(name)s) в фазе строки таблицы. Игнорируется.

source: Unexpected select start tag in the select phase treated as select end tag.
ru: Неожиданный начальный тег выбора в фазе выбора, который рассматривается как конечный тег соответствующей операции.

source: Unexpected input start tag in the select phase.
ru: Неожиданный входной начальный тег в фазе выбора.

source: Unexpected start tag token (%(name)s in the select phase. Ignored.
ru: Неожиданный токен начального тега (%(name)s в фазе выбора. Игнорируется.

source: Unexpected end tag (%(name)s) in the select phase. Ignored.
ru: Неожиданный конечный тег (%(name)s) в фазе выбора. Игнорируется.

source: Unexpected table element start tag (%(name)s) in the select in table phase.
ru: Неожиданный начальный тег элемента таблицы (%(name)s) в операции выбора в фазе таблицы.

source: Unexpected table element end tag (%(name)s) in the select in table phase.
ru: Неожиданный конечный тег элемента таблицы (%(name)s) в операции выбора в фазе таблицы.

source: Unexpected non-space characters in the after body phase.
ru: Неожиданные символы, не являющиеся пробелами, в фазе после тела.

source: Unexpected start tag token (%(name)s) in the after body phase.
ru: Неожиданный токен начального тега (%(name)s) в фазе после тела.

source: Unexpected end tag token (%(name)s) in the after body phase.
ru: Неожиданный токен конечного тега (%(name)s) в фазе после тела.

source: Unepxected characters in the frameset phase. Characters ignored.
ru: Неожиданные символы в фазе фреймов. Символы игнорируются.

source: Unexpected start tag token (%(name)s) in the frameset phase. Ignored.
ru: Неожиданный токен начального тега (%(name)s) в фазе фреймов. Игнорируется.

source: Unexpected end tag token (frameset) in the frameset phase (innerHTML).
ru: Неожиданный токен конечного тега (фреймы) в фазе фреймов (innerHTML).

source: Unexpected end tag token (%(name)s) in the frameset phase. Ignored.
ru: Неожиданный токен конечного тега (%(name)s) в фазе фреймов. Игнорируется.

source: Unexpected non-space characters in the after frameset phase. Ignored.
ru: Неожиданные символы, не являющиеся пробелами, в фазе после фреймов. Игнорируется.

source: Unexpected start tag (%(name)s) in the after frameset phase. Ignored.
ru: Неожиданный начальный тег (%(name)s) в фазе после фреймов. Игнорируется.

source: Unexpected end tag (%(name)s) in the after frameset phase. Ignored.
ru: Неожиданный конечный тег (%(name)s) в фазе после фреймов. Игнорируется.

source: Unexpected end tag after body(innerHtml)
ru: Неожиданный конечный тег после тела (innerHtml)

source: Unexpected non-space characters. Expected end of file.
ru: Неожиданные символы, не являющиеся пробелами. Ожидается конец файла.

source: Unexpected start tag (%(name)s). Expected end of file.
ru: Неожиданный начальный тег (%(name)s). Ожидается конец файла.

source: Unexpected end tag (%(name)s). Expected end of file.
ru: Неожиданный конечный тег (%(name)s). Ожидается конец файла.

source: Unexpected end of file. Expected table content.
ru: Неожиданный конец файла. Ожидается содержание таблицы.

source: Unexpected end of file. Expected select content.
ru: Неожиданный конец файла. Ожидается выбранное содержание.

source: Unexpected end of file. Expected frameset content.
ru: Неожиданный конец файла. Ожидается содержание фреймов.

source: Unexpected end of file. Expected script content.
ru: Неожиданный конец файла. Ожидается содержание скрипта.

source: Trailing solidus not allowed on element %(name)s
ru: Завершающая косая черта недопустима в элементе %(name)s

source: Element %(name)s not allowed in a non-html context
ru: Элемент %(name)s запрещен в контексте, отличном от HTML

source: Unexpected end tag (%(name)s) before html.
ru: Неожиданный конечный тег (%(name)s) перед HTML-кодом.

source: StartTag not in PCDATA content model flag: %(tag)s
ru: StartTag отсутствует в пометке модели содержания PCDATA: %(tag)s

source: Tag name is not a string: %(tag)r
ru: Название тега не является строкой: %(tag)r

source: Empty tag name
ru: Пустое название тега

source: Void element reported as StartTag token: %(tag)s
ru: Непустой элемент принят за токен StartTag: %(tag)s

source: Non-void element reported as EmptyTag token: %(tag)s
ru: Непустой элемент принят за токен EmptyTag: %(tag)s

source: Attribute name is not a string: %(name)r
ru: Название атрибута не является строкой: %(name)r

source: Empty attribute name
ru: Название атрибута не указано

source: Attribute value is not a string: %(value)r
ru: Значение атрибута не является строкой: %(value)r

source: Void element reported as EndTag token: %(tag)s
ru: Сообщение о пустом токене EndTag: %(tag)s

source: EndTag (%(end)s) does not match StartTag (%(start)s)
ru: Несоответствие тегов EndTag (%(end)s) и StartTag (%(start)s)

source: Comment not in PCDATA content model flag
ru: В пометке модели содержания PCDATA отсутствует комментарий

source: %(type)s token with empty data
ru: Токен %(type)s без данных

source: Non-space character(s) found in SpaceCharacters token: %(token)r
ru: В токене SpaceCharacters обнаружены символы, не являющиеся пробелами: %(token)r

source: Doctype not in PCDATA content model flag: %(name)s
ru: Элемент Doctype отсутствует в пометке модели содержания PCDATA: %(name)s

source: Unknown token type: %(type)s
ru: Неизвестный тип токена: %(type)s

source: System identifer contains both single and double quote characters
ru: Идентификатор системы содержит одновременно одинарные и двойные кавычки

source: Unexpected </ in CDATA
ru: Неожиданные символы "</" в теге CDATA

source: Unexpected child element of a CDATA element
ru: Неожиданный дочерний элемент в элементе CDATA

source: Comment contains --
ru: Комментарий содержит --

source: Void element has children
ru: Пустой элемент содержит дочерние элементы

source: Unknown node type:
ru: Неизвестный тип узла:

source: Text nodes are text or tail, found %s
ru: Текстовые узлы имеют вид текста или "хвоста", обнаружен элемент %s.

source: Text nodes have no children
ru: Текстовые узлы не имеют дочерних элементов

source: 404 - Page Not Found
ru: 404 – страница не найдена

source: I pity da foo who doesn't use HTML5!
ru: Мне жаль тех, кто не использует HTML5!

source: Except as otherwise <a href="http://code.google.com/policies.html#restrictions">noted</a>, the content of this page is licensed under the <a href="http://creativecommons.org/licenses/by/3.0/">Creative Commons Attribution 3.0 License</a>, and code samples are licensed under the <a href="http://www.apache.org/licenses/LICENSE-2.0">Apache 2.0 License</a>.
ru: Если не <a href="http://code.google.com/policies.html#restrictions">указано</a> иное, на содержание этой страницы распространяется действие <a href="http://creativecommons.org/licenses/by/3.0/">лицензии Creative Commons Attribution 3.0</a>, а на примеры кода – <a href="http://www.apache.org/licenses/LICENSE-2.0">лицензии Apache 2.0</a>.

source: Please enable JavaScript to view the comments powered by Disqus.
ru: Для просмотра комментариев Disqus включите JavaScript.

source: html5,html 5,html5 demos,html5 examples,javascript,css3,notifications,geolocation,web workers,apppcache,file api,filereader,indexeddb,offline,audio,video,drag and drop,chrome,sse,mobile
ru: html5,html 5,демонстрации html5,примеры html5,javascript,css3,уведомления,геолокация,объекты web worker,кэш-память приложений,api для работы с файлами,чтение файлов,индексированные базы данных,автономный режим,аудио,видео,перетаскивание,chrome,sse,мобильные устройства

source: HTML5 Rocks RSS
ru: RSS-фид HTML5 Rocks

source: Posts &amp; Tutorials
ru: Статьи и руководства

source: Slides
ru: Слайды

source: Who We Are
ru: Кем мы являемся?

source: Search
ru: Поиск

source: Intro
ru: Вступление

source: Demos
ru: Демонстрационные примеры

source: In the Wild
ru: В реальных условиях

source: Themes
ru: Темы

source: Technologies
ru: Технологии

source: Techniques
ru: Методы

source: Further Reading
ru: Дополнительные материалы

source: HTML5 Logo
ru: Логотип HTML5

source: Terms
ru: Условия

source: Privacy
ru: Конфиденциальность

source: Report bug or request a feature
ru: Сообщить об ошибке или запросить функцию

source: Follow us on Twitter
ru: Следите за нашими обновлениями в Twitter

source: About Authors
ru: Об авторах

source: Made by Google
ru: Сделано в Google

source: This site contains information on APIs that are not part of the W3C HTML5 specification.
ru: На этом сайте приведены сведения об API, которые не входят в спецификацию W3C HTML5.

source: A new version of this site is available. Load it?
ru: Доступна новая версия этого сайта. Загрузить?

source: Published
ru: Опубликовано

source: Updated
ru: Обновлено

source: HTML5 Powered
ru: На базе HTML5

source: Supported browsers:
ru: Поддерживаемые браузеры:

source: supported
ru: поддерживается

source: unsupported
ru: не поддерживается

source: Your browser may not support all of the functionality in this article.
ru: Ваш браузер может не поддерживать некоторые из описываемых функций.

source: Your browser appears to support all of the functionality in this article.
ru: Похоже, ваш браузер поддерживает все функции, рассматриваемые в этой статье.

source: Leave a comment
ru: Оставить комментарий

source: Table of Contents
ru: Содержание

source: Localizations
ru: Переводы

source: This article is additionally available in the following languages:
ru: Эта статья также доступна на следующих языках:
