Repository: html5rocks/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Reference on the various dragging options that are available in the DnD API
ru: Справочные материалы по различным вариантам реализации перетаскивания, доступным в API перетаскивания

source: Article on using Native Drag and Drop in HTML5. Discusses File drag/drop from desktop.
ru: Статья об использовании встроенных функций перетаскивания в HTML5, в которой обсуждается применение этих функций к файлам, расположенным на рабочем столе.

source: Graphics
ru: Графические объекты

source: The web has always been a visual medium, but a restricted one at best. Until recently, HTML developers were limited to CSS and JavaScript in order to produce animations or visual effects for their websites, or they would have to rely on a plugin like Flash.
ru: Интернет всегда являлся наглядной, но в то же время ограниченной информационной средой. До недавнего времени разработчики HTML были ограничены такими средствами, как CSS и JavaScript; им оставалось лишь создавать анимацию или визуальные эффекты для веб-сайтов либо полагаться на подключаемые модули, например Flash.

source: With the addition of technologies like the canvas element, Web GL, and SVG images, this is no longer the case! In fact, there are many new features which deal with graphics on the web: 2D Canvas, WebGL, SVG, 3D CSS transforms, and SMIL.
ru: С появлением таких технологий, как элемент canvas, Web GL и SVG-графика, все изменилось. На сегодняшний день доступно множество новых функций для работы с графикой в Интернете: двумерный элемент canvas, WebGL, SVG, трехмерные преобразования CSS и SMIL.

source: Of course, none of these new technologies would be useful if they weren&rsquo;t capable of running fast. Thankfully, JavaScript engines have become fast enough to run 3D games and manipulate video in realtime. Hardware accelerated compositing is also being implemented in many browsers, meaning that even CSS transitions and transforms will be butter-smooth.
ru: Конечно, польза всех этих новых технологий измеряется скоростью их работы. К счастью, обработчики JavaScript стали достаточно быстрыми для запуска 3D-игр и работы с видео в режиме реального времени. Во многих браузерах уже реализовано аппаратное ускорение, а это значит, что даже переходы и преобразования CSS выполняются очень плавно.

source: Developers are taking advantage of these features: a flood of HTML graphics demos have been showing up on the web, ranging from implementations of old 2D graphics algorithms, to brand new techniques created specifically for the modern web.
ru: Разработчики уже используют эти функции: в сети появилось множество графических примеров на базе HTML, начиная с реализации старых двумерных графических алгоритмов и заканчивая новейшими технологиями, созданными с учетом требований современного Интернета.

source: Browser Support
ru: Поддержка браузеров

source: &ldquo;Graphics&rdquo; is such a wide topic that there are several specifications being worked on. A comprehensive graphics demo may use several of the following:
ru: Тема &ldquo;графических объектов&rdquo; настолько широка, что существует несколько параллельных спецификаций. В детальных демонстрациях графических возможностей могут использоваться некоторые из перечисленных ниже технологий.

source: PNG Alpha Transparency
ru: Альфа-прозрачность PNG-изображений

source: Data URLs
ru: URL данных

source: CSS3 Colors
ru: Цвета CSS3

source: SVG (basic support)
ru: SVG (базовая поддержка)

source: Canvas (basic support)
ru: Canvas (базовая поддержка)

source: Video element
ru: Элемент видео

source: CSS Transforms
ru: Преобразования CSS

source: Text API for Canvas
ru: API текста для элемента canvas

source: SVG in CSS Backgrounds
ru: SVG в фоновых объектах CSS

source: SVG effects for HTML elements
ru: Эффекты SVG для HTML-элементов

source: SVG SMIL animation
ru: Анимация SVG SMIL

source: SVG Fonts
ru: Шрифты SVG

source: SVG filters
ru: SVG-фильтры

source: CSS3 Animation
ru: Анимация CSS3

source: Inline SVG in HTML5
ru: Встраивание SVG в HTML5

source: 3D Canvas graphics / WebGL
ru: Трехмерная графика на базе элемента canvas и технологии WebGL

source: CSS 3D Transforms
ru: Трехмерные преобразования CSS

source: Click each specification to see its support status on <a href="http://caniuse.com/">caniuse.com</a>. Chrome-specific details can be found on the <a href="http://dev.chromium.org/developers/web-platform-status">Chrome Platform Status</a>.
ru: Нажимайте на спецификации, чтобы получить информацию об их поддержке с сайта <a href="http://caniuse.com/">caniuse.com</a>. Информацию о Chrome можно найти на сайте <a href="http://dev.chromium.org/developers/web-platform-status">статуса платформы Chrome</a>.

source: Various WebGL / canvas demos which take advantage of HW accel
ru: Различные примеры реализации WebGL и canvas, в которых используется аппаратное ускорение

source: WebGL solid modeling CAD
ru: Автоматизированная система создания сплошных моделей WebGL

source: 3D effects without WebGL
ru: Трехмерные эффекты без WebGL

source: Nicely polished canvas experiments
ru: Красивые примеры использования элемента canvas

source: Old-school games effect
ru: Эффект из старых игр

source: Various canvas demos which take advantage of HW accel
ru: Различные примеры реализации элемента canvas, в которых используется аппаратное ускорение

source: Nice integration between video and canvas
ru: Качественная интеграция видео с элементом canvas

source: Support SVG on all browsers
ru: Поддержка SVG во всех браузерах

source: SVG, CSS, Canvas support for Illustrator
ru: Поддержка SVG, CSS и элемента canvas для Illustrator

source: Animation library wrapping SVG
ru: Библиотеки анимации в качестве оболочки для SVG

source: JavaScript scenegraph library for the canvas element
ru: Библиотека графов сцен JavaScript для элемента canvas

source: Port of Processing animation scripting language to JavaScript - uses canvas
ru: Перенос скриптового языка обработки анимации на JavaScript с использованием элемента canvas

source: Lightweight 3D engine, uses canvas, SVG, WebGL
ru: Легкая трехмерная платформа, в которой используются технологии canvas, SVG и WebGL

source: Background and details on the implementation of hardware accelerated compositing in Chrome
ru: Справочная информация и подробные сведения о реализации обработки с аппаратным ускорением в Chrome

source: Features
ru: Функции

source: Multimedia
ru: Мультимедиа

source: Audio and Video became first-class citizens on the Web with HTML5 the same way that other media types like images did in the past. Through their new APIs you can access, control and manipulate timeline data and network states of the files. With the coming additions to the APIs you will be able to read and write raw data to audio files (Audio Data API) or manipulate captions in videos (Timed Track API). But the real power of these new HTML elements stands out when they are combined with the other technologies of the web stack, be it Canvas, SVG, CSS or even WebGL.
ru: Роль аудио- и видеоматериалов в Интернете возросла с появлением HTML5. В свое время похожий рост популярности пережили другие форматы медиаданных, такие как изображения. С помощью новых API можно обращаться к данным временной шкалы и состояния файлов в сети и работать с ними. Вскоре будут выпущены дополнения к API, которые позволят считывать исходные данные из аудиофайлов и вести в них запись (API звуковых данных), а также работать с подписями к видео (API контроля времени). Однако реальные возможности этих новых HTML-элементов лучше всего реализуются в сочетании с другими интернет-технологиями, такими как canvas, SVG, CSS и даже WebGL.

source: For instance, you can build a DJ mixer table app where you show several controls to fade and mix audio tracks. Canvas lets you read pixel data from videos so you could add a video visualizer with a scene selection feature and, on top of that, use SVG filters &aacute; la Photoshop to distort the movie while the videos are playing.
ru: Например, можно создать симулятор DJ-пульта с ползунками и регуляторами для управления затуханием и сведением звуковых дорожек. Canvas позволит считывать данные пикселей из видеофайла, благодаря чему вы сможете добавить визуализатор с функцией выбора фона. В завершение воспользуйтесь SVG-фильтрами а-ля Photoshop, чтобы изменять изображение в такт музыке.

source: This W3C specification defines the audio element with all the available methods, attributes and events.
ru: В этой спецификации W3C определяется элемент аудио со всеми доступными методами, атрибутами и событиями.

source: This W3C specification defines the video element with all the available methods, attributes and events.
ru: В этой спецификации W3C определяется элемент видео со всеми доступными методами, атрибутами и событиями.

source: This W3C specification defines those methods and properties which are common to both audio and video elements.
ru: Эта спецификация W3C определяет общие методы и свойства для аудио- и видеоэлементов.

source: A subset of the media element spec currently being written where it defines means to handle metadata of audio/video files such as captions and subtitles.
ru: В настоящее время создается спецификация для подмножества мультимедийных элементов, в которой определяются средства обработки метаданных аудио- и видеофайлов, таких как подписи и субтитры.

source: Draft recommendation for Audio Data API where methods are defined to read and write spectrum data of audio files.
ru: Черновой вариант рекомендации API звуковых данных, в котором определяются методы считывания и записи данных звукового ряда аудиофайлов.

source: Nuts & Bolts
ru: Обо всем по порядку

source: HTML5 is now an umbrella term that many people use to describe the amazing improvements coming to the web platform. It's a platform that is becoming more powerful by the day. Most people have heard of the rich APIs (css3, audio/video, WebGL, offline, geolocation,...), but there's also a slew of lesser-known features that you should be aware of. We call these the "nuts &amp; bolts" of building modern web applications.
ru: Сейчас HTML5 используется в качестве общего названия значительных улучшений веб-платформы. Эта платформа с каждым днем становится все мощнее. Большинство пользователей слышали о популярных API (css3, аудио и видео, WebGL, автономный режим, геопозиционирование и т. д.), но существует также множество менее известных функций, о которых следует знать. Мы называем их "кирпичиками" для создания современных веб-приложений.

source: Isn't it painful to build web apps? Luckily, smart folks are improving the underlying (core) platform to make our lives easier. These improvements include additions to ECMAScript (the JavaScript language), ways to interact with the DOM, and even old friends like <code>XMLHttpRequest</code> and <code>&lt;input type="file"&gt;</code>. Here are just a few:
ru: Создавать веб-приложения – нелегкое дело, не правда ли? К счастью, разработчики улучшают ядро платформы, чтобы упростить нашу работу. В список этих улучшений входят дополнения к ECMAScript (языку JavaScript), способы взаимодействия с DOM и даже такие проверенные средства, как <code>XMLHttpRequest</code> и <code>&lt;input type="file"&gt;</code>. Вот некоторые из них:

source: JavaScript <a href="https://developer.mozilla.org/en/JavaScript_typed_arrays">Typed Arrays</a>
ru: <a href="https://developer.mozilla.org/en/JavaScript_typed_arrays">Типизированные массивы</a> JavaScript

source: New selectors: <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelector()</code></a>, <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelectorAll()</code></a>, <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#13"><code>matchesSelector()</code></a>
ru: Новые селекторы: <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelector()</code></a>, <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelectorAll()</code></a>, <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#13"><code>matchesSelector()</code></a>

source: Custom data-* attributes: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#12"><code>Element.dataset</code></a>
ru: Пользовательские атрибуты данных*: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#12"><code>Element.dataset</code></a>

source: <a href="http://dvcs.w3.org/hg/domcore/raw-file/tip/Overview.html#mutation-observers">Mutation Observers</a>
ru: <a href="http://dvcs.w3.org/hg/domcore/raw-file/tip/Overview.html#mutation-observers">Объекты MutationObserver</a>

source: <a href="http://hacks.mozilla.org/2011/11/html5-context-menus-in-firefox-screencast-and-code/">Context menus</a>
ru: <a href="http://hacks.mozilla.org/2011/11/html5-context-menus-in-firefox-screencast-and-code/">Контекстные меню</a>

source: These additions make apps easier to build, offload more work to the browser, and reduce your footprint (e.g. by removing the need for libraries that handle the same functionality).
ru: Эти дополнения упрощают разработку приложений, разгружают их за счет перенаправления задач браузеру, а также снижают объемы используемого пространства и памяти (например, устраняют потребность в библиотеках, выполняющих одинаковые функции).

source: With smarter APIs, we can build smarter apps
ru: Чем интеллектуальнее API в нашем арсенале, тем более совершенные приложения мы можем создать.

source: The platform includes APIs that give you greater insight into what is happening in your application. These APIs allow you to make smarter choices in your app, save battery/CPU, and create a better user experience.
ru: В платформу входят API, способные пролить свет на работу приложения. Они помогут выбрать лучшие архитектурные решения, сэкономить заряд батареи, уменьшить нагрузку на процессор, а также улучшить взаимодействие пользователя с системой.

source: Smarter animations: <code>window.requestAnimationFrame()</code>
ru: Более совершенная анимация: <code>window.requestAnimationFrame()</code>

source: Form factor detection: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#16"><code>window.matchMedia()</code></a> and CSS media queries.</code>
ru: Распознавание форм-факторов <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#16"><code>window.matchMedia()</code></a> и мультимедийные запросы CSS.</code>

source: <a href="http://slides.html5rocks.com/#history-api">History API</a>
ru: <a href="http://slides.html5rocks.com/#history-api">API истории</a>

source: <a href="http://updates.html5rocks.com/2011/06/Page-Visibility-API-Have-I-got-your-attention">Page Visibility API</a>
ru: <a href="http://updates.html5rocks.com/2011/06/Page-Visibility-API-Have-I-got-your-attention">API видимости страниц</a>

source: <a href="https://developer.mozilla.org/en/Online_and_offline_eventsion">online/offline events</a>
ru: <a href="https://developer.mozilla.org/en/Online_and_offline_eventsion">Сетевые и автономные события</a>

source: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#28">Custom protocol/content handlers</a>
ru: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#28">Пользовательский протокол и обработчики содержимого</a>

source: Whitepaper on using the Page Visibility API.
ru: Техническое описание на тему использования API видимости страниц

source: How to use the <code>rel='prerender'</code> attribute to prerender content in a background tab.
ru: Использование <code>rel='prerender'</code> атрибутов для предварительной обработки содержания в фоновой вкладке.

source: MDN reference on online/offline events.
ru: Справка MDN по автономным и сетевым событиям.

source: MDN reference on JS typed arrays.
ru: Справка MDN по типизированным массивам JS

source: MDN refernce on <code>window.requestAnimationFrame()</code>
ru: Справка MDN по <code>window.requestAnimationFrame()</code>

source: MDN reference on the <code>window.history</code> API.
ru: Справка MDN по API <code>window.history</code>.

source: MDN documentation for <code>navigator.registerProtocolHandler()</code>.
ru: Документация MDN для <code>navigator.registerProtocolHandler()</code>.

source: MDN documentation for <code>navigator.registerContentHandler()</code>.
ru: Документация MDN для <code>navigator.registerContentHandler()</code>.

source: Allows apps to register an intent to handle common user actions.
ru: Позволяет приложениям регистрировать объекты Intent для обработки распространенных действий пользователей.

source: MDN reference on using features in <code>XMLHttpRequest2</code>.
ru: Справка MDN по использованию функций в <code>XMLHttpRequest2</code>.

source: "Web" and "online" are two closely associated terms, downright synonymous to many people. So why on earth would we talk about "offline" web technologies, and what does the term even mean?
ru: Термины "Интернет и "онлайн" тесно связаны между собой, а для многих людей полностью синонимичны. Итак, зачем нам интересоваться "автономными" веб-технологиями и что означает этот термин?

source: HTML5 and related specs introduce a number of features to make offline web apps a reality:
ru: HTML5 и сопутствующие спецификации предоставляют ряд функций, помогающих в создании автономных веб-приложений:

source: application cache
ru: кэш приложений

source: web SQL &amp; indexed database
ru: веб-SQL и индексированная база данных

source: online/offline events
ru: события в режиме подключения и автономном режиме

source: For a whirlwind overview of the offline landscape, consider the article <a href="/tutorials/offline/whats-offline/">"Offline": What does it mean and why should I care?</a>. These features can also be used to improve an application&rsquo;s performance by storing data in the cache or to make data persistent between user sessions and when reloading and restoring pages.
ru: Чтобы подробнее ознакомиться с автономными веб-технологиями, прочитайте статью о <a href="/tutorials/offline/whats-offline/">важности и значении автономного режима</a>. Вы узнаете, что производительность приложений можно повысить, помещая данные в кэш-память или храня их между пользовательскими сеансами, а также при обновлении и восстановлении страниц.

source: Presented by Nikolas Coukouma, January 5, 2011
ru: Представлено Николасом Кукума (Nikolas Coukouma), 5 января 2011 г.

source: The w3c spec has the strict details on how the cache.manifest and applicationCache APIs work.
ru: В спецификации W3C приведены строго упорядоченные сведения о работе API cache.manifest и applicationCache.

source: Mark Pilgrim dives into using the app cache in practice.
ru: Марк Пилгрим (Mark Pilgrim) рассматривает использование кэша приложений на практике.

source: Mozilla Developer Center reference documentation and guides, covering online and offline events and app cache.
ru: Справочная документация и руководства Центра разработчиков Mozilla, в которых рассматриваются события в режиме подключения и автономном режиме, а также кэш приложений.

source: Creating a todo list manager using localStorage, app cache and offline events. Putting everything together.
ru: Создание диспетчера списка задач с использованием локального хранилища localStorage, кэша приложений и событий в автономном режиме, а также объединение всех элементов.

source: The app cache explained with solid examples showing different features and configurations in use.
ru: Обзор кэша приложений с понятными примерами использования различных функций и конфигураций.

source: The C code used by Webkit for the app cache
ru: Код на языке C, используемый в Webkit для кэша приложений

source: Web apps are now able to rival performance of native and desktop applications. By using a variety of techniques and technologies, your sites and apps can feel more responsive and your users will get more done. Performance is important, it's a constant theme across all aspects of your development and product.
ru: Веб-приложения теперь могут соперничать по эффективности с традиционными программами для компьютеров. С помощью различных методов и технологий можно уменьшить время реагирования сайтов и приложений, тем самым повысив производительность пользователей. Эффективность сложно переоценить – сейчас она является ключевым приоритетом при разработке программных продуктов.

source: Writing fast and responsive apps isn't just important for your users, it's important for your bottom line. For example, <a href="http://googlewebmastercentral.blogspot.com/2010/04/using-site-speed-in-web-search-ranking.html">Google now incorporates site speed in page ranking</a>. <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Amazon has found that every 100 ms increase in page load time decreased sales by 1%%</a>. Also, <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Microsoft found that slowing a page by 2 seconds decreased ad clicks by 4%%</a>.
ru: Производительность приложения и его быстрая реакция на действия важны не только для пользователей. Эти параметры также являются значимыми с точки зрения прибыльности. Например, <a href="http://googlewebmastercentral.blogspot.com/2010/04/using-site-speed-in-web-search-ranking.html">при ранжировании страниц в Google теперь учитывается скорость реагирования сайта</a>. <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Компания Amazon обнаружила, что увеличение времени загрузки страницы на 100 мс снижает уровень продаж на 1%%</a>. Кроме того, <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">по данным корпорации Майкрософт, увеличение времени загрузки страницы на 2 секунды приводит к снижению количества кликов по рекламе на 4%%</a>.

source: Web app optimization cross cuts all aspects of development, from the server to the network to the client. Focusing on performance is critical to success.
ru: Оптимизация веб-приложений связана со всеми аспектами разработки: от сервера и сети до клиента. Эффективность – залог успеха.

source: Store locally.
ru: Локальное хранение данных.

source: Data stored on the client is quicker to access than data stored on the server. Also, data stored closer to the calculation is quicker to access.
ru: Доступ к данным, хранящимся на клиенте, осуществляется быстрее, чем к данным на сервере. Кроме того, за счет уменьшения расстояния ускоряется и доступ к данным для расчета.

source: Process in the background.
ru: Процесс в фоновом режиме.

source: Anything that doesn't help the user see a response to their action should be performed in the background.
ru: Все, что не помогает пользователю увидеть ответ на его действия, должно выполняться в фоновом режиме.

source: Minimize connections.
ru: Уменьшение количества соединений.

source: Each connection requires work for setup and teardown.
ru: При каждом соединении требуется выполнять установку и демонтаж.

source: Decrease bandwidth.
ru: Уменьшение объема трафика.

source: Less bandwidth means a faster response.
ru: Уменьшение трафика ведет к ускорению реакции.

source: HTTP caching
ru: Кэширование HTTP

source: Allow clients and servers to reduce connections and bandwidth.
ru: Сократите количество соединений и объем трафика на клиентах и серверах.

source: HTTP caching servers
ru: Серверы HTTP-кэширования

source: Servers like <a href="http://www.varnish-cache.org/">Varnish</a> and <a href="http://www.squid-cache.org/">Squid</a> can cache your content.
ru: Серверы, такие как <a href="http://www.varnish-cache.org/">Varnish</a> и <a href="http://www.squid-cache.org/">Squid</a>, могут кэшировать содержание.

source: Memcache
ru: Кэш памяти
