Repository: html5rocks/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Expanding on the <a href="/%(LANGUAGE_CODE)s/tutorials/webdatabase/todo/">simple TODO list</a>, this tutorial gives a practical guide for taking the sample offline using the application cache.
ru: В этом руководстве рассматривается <a href="/%(LANGUAGE_CODE)s/tutorials/webdatabase/todo/">простой список задач</a> и приводятся рекомендации по переводу образца приложения в автономный режим с помощью кэша приложений.

source: Reading files in JavaScript using the File APIs
ru: Чтение файлов в JavaScript с помощью API файлов

source: Starter guide for using the File/FileList/FileReader APIs to process and read binary files in JavaScript.
ru: Руководство по началу работы с API файлов, списка файлов и чтения файлов для обработки и считывания двоичных файлов в JavaScript.

source: A Simple Trip Meter using the Geolocation API
ru: Простой счетчик пробега, в котором используется API геопозиционирования

source: Learn how to implement geolocation very quickly including a distance calculator
ru: Узнайте, как быстро реализовать геопозиционирование, в том числе калькулятор расстояний.

source: Using the Notifications API
ru: Использование API оповещений

source: Learn the notification basics creating a twitter notification
ru: Познакомьтесь с основами создания оповещений в Twitter.

source: A Simple TODO list using HTML5 WebDatabases
ru: Простой список задач с использованием веб-баз данных HTML5

source: Create a TODO list which persists data using a client side database.
ru: Создание списка задач с хранением данных в клиентской базе.

source: Quick Guide to Implementing the HTML5 Audio Tag
ru: Краткое руководство по реализации тега аудио HTML5

source: Learn how to use the HTML5 audio tag and fall back to Flash on platforms which do not support it.
ru: Узнайте, как использовать тег аудио HTML5 и заменить его функциями Flash на платформах, которые не поддерживают этот формат.

source: this feature
ru: эта функция

source: HTML5Rocks - Posts & Tutorials
ru: HTML5Rocks – Статьи и руководства

source: A resource for developers looking to put HTML5 to use today, including information on specific features and when to use them in your apps.
ru: Ресурс для разработчиков, которые хотят перейти на HTML5 уже сегодня, содержащий, помимо прочего, сведения об определенных функциях и их использовании в приложениях.

source: Sorry, this article isn't available in your native language; we've redirected you to the English version.
ru: К сожалению, эта статья недоступна на вашем языке. Вы были перенаправлены на английскую версию.

source: Home
ru: Главная страница

source: Community
ru: Сообщество

source: The HTML5 community is getting bigger and bigger. Here you will find some resources to be up to date about the latest HTML5 news as well as to be able to discuss with developers and engineers the experimental features and proposals around the standards and browser implementations.
ru: Сообщество HTML5 постоянно растет. В нем можно найти последние новости об HTML5, а также обсудить с разработчиками и инженерами экспериментальные функции и предложения относительно стандартов и их реализации в браузерах.

source: Forum
ru: Форум

source: Events
ru: События

source: IRC Channel
ru: IRC-канал

source: HTML5 conferences (Lanyrd)
ru: Конференции по HTML5 (Lanyrd)

source: HTML5 Meetup Groups
ru: Группы в рамках конференций по HTML5

source: Google Developer Events Calendar
ru: Календарь мероприятий Google для разработчиков

source: HTML5 Events
ru: События HTML5

source: A resource for open web HTML5 developers
ru: Ресурс для веб-разработчиков открытого кода HTML5

source: Latest Articles
ru: Последние статьи

source: Tweet
ru: Отправить твит

source: See more &rarr;
ru: Еще &rarr;

source: Welcome to HTML5ROCKS
ru: Добро пожаловать в HTML5Rocks!

source: What kind of HTML dev do you think you are?
ru: Что вы будете писать на HTML?

source: HTML5 is the ubiquitous platform for the web. Whether you're a mobile web developer, an enterprise with specific business needs, or a serious game dev looking to explore the web as a new platform, HTML5 has something for you! Choose your path:
ru: HTML5 – это универсальная платформа для сети. Вне зависимости от того, разрабатываете ли вы приложения для мобильных устройств, являетесь предпринимателем с конкретными потребностями или опытным разработчиком игр, рассматривающим Интернет в качестве новой платформы, HTML5 предложит вам множество возможностей. Вам нужно лишь выбрать направление.

source: Mobile
ru: Мобильные устройства

source: Web developers can use the same set of technologies they know and love to build rich web applications that work across different device types.
ru: Веб-разработчики могут использовать хорошо известный и привычный набор технологий для создания передовых кроссплатформенных веб-приложений.

source: Gaming
ru: Компьютерные игры

source: High performance 2D/3D graphics, offline asset storage, rich audio APIs, and socket-based networking let you create compelling modern games and reach users like never before.
ru: Высокая производительность 2D- и 3D-графики, автономное хранение объектов, функциональные API для работы со звуком и работа с сетью, основанная на сокетах, позволят разрабатывать современные конкурентоспособные игры и расширять аудиторию пользователей.

source: Business
ru: Бизнес

source: HTML5 brings substantial benefits for companies that no other IT model can &ndash; in simplicity, cost, security, flexibility and mobility.
ru: HTML5 представлять компаниям преимущества, недоступные а других ИТ-моделях: простоту, снижение расходов, безопасность, гибкость и мобильность.

source: Or get straight to the tech!
ru: Или перейдите к техническим статьям.

source: HTML5 Features
ru: Функции HTML5

source: HTML5 is making the web platform more powerful in a number of different areas. Try learning by major HTML5 feature groups.
ru: HTML5 повышает производительность веб-платформы по различным показателям. Узнайте больше об основных группах функций HTML5.

source: Offline
ru: В автономном режиме

source: Storage
ru: Хранилище

source: Connectivity
ru: Возможность подключения

source: File Access
ru: Доступ к файлам

source: Semantics
ru: Семантика

source: Audio/Video
ru: Аудио/видео

source: 3D/Graphics
ru: 3D-графика

source: Presentation
ru: Презентация

source: Performance
ru: Производительность

source: Nuts &amp; Bolts
ru: Обо всем по порядку

source: Why HTML5?
ru: Почему именно HTML5?

source: Why you should care.
ru: Преимущества

source: HTML5 introduces many cutting-edge features that enable developers to create web apps&hellip;
ru: HTML5 предлагает разработчикам веб-приложений множество передовых функций.

source: Updates
ru: Обновления

source: Learn what's new.
ru: Узнайте, что нового.

source: Articles, tutorials, case studies, and demos that show you how to use HTML5 features.
ru: Статьи, руководства, описания проектов и демонстрации, рассказывающие об использовании функций HTML5.

source: Resources
ru: Ресурсы

source: All HTML5, all the time.
ru: Все это – HTML5.

source: Cultivated list of additional resources to help you on your HTML5 learning voyage.
ru: Расширенный список дополнительных ресурсов, которые помогут вам в изучении HTML5.

source: Contributors
ru: Авторы

source: HTML5 Gurus Rock
ru: Эксперты HTML5 Rocks

source: HTML5Rocks is <a href="http://code.google.com/p/html5rocks/" rel="external">open source</a> and community driven. Tweak the code or <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">contribute</a> a new tutorial. We'd love to have your help and expertise!
ru: HTML5Rocks – это <a href="http://code.google.com/p/html5rocks/" rel="external">проект с открытым исходным кодом</a>, над которым трудится сообщество. Вы можете поэкспериментировать с кодом или <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">добавить</a> новое руководство. Мы с охотно примем вашу помощь и профессиональные советы!

source: <strong>Follow us</strong> on <span>Google+</span>
ru: <strong>Найдите нас</strong> на <span>Google+</span>

source: Privacy Policy
ru: Политика конфиденциальности

source: HTML5 Rocks <span>Privacy Policy</span>
ru: <span>Политика конфиденциальности</span> HTML5 Rocks

source: The HTML5ROCKS website (the "Website") is hosted by Google and, as such, for the purposes of personal information, the Website operates as any other Google service. Google's Privacy Policy is available at <a href="http://www.google.com/privacy.html">http://www.google.com/privacy.html</a>.</p>
ru: Веб-сайт HTML5Rocks (далее Веб-сайт) размещен на серверах Google, поэтому он обрабатывает личную информацию так же, как и другие службы Google. С Политикой конфиденциальности Google можно ознакомиться по адресу <a href="http://www.google.com/privacy.html">http://www.google.com/privacy.html</a>.</p>

source: Author Profiles
ru: Профили авторов

source: Authors
ru: Авторы

source: Our honorable contributors.
ru: Наши почетные авторы

source: You can <a href="http://twitter.com/ChromiumDev">follow us on Twitter</a>, read the <a href="/%(LANGUAGE_CODE)s/tos">Terms of Service</a> or <a href="/%(LANGUAGE_CODE)s/privacy">Privacy Policy</a>, or <a href="http://code.google.com/p/html5rocks/issues/entry">report a bug or request a feature</a>. <small>This site contains information on APIs that are not part of the W3C HTML5 specification.</small>
ru: <a href="http://twitter.com/ChromiumDev">Следите за нашими обновлениями в Twitter</a>, ознакомьтесь с <a href="/%(LANGUAGE_CODE)s/tos">Условиями использования</a> или <a href="/%(LANGUAGE_CODE)s/privacy">Политикой конфиденциальности</a>. Также можно <a href="http://code.google.com/p/html5rocks/issues/entry">сообщить об ошибке или запросить новую функцию</a>. <small>Этот сайт содержит сведения об API, не входящих в спецификации W3C HTML5.</small>

source: <strong>HTML5 Rocks</strong> is a <strong><img src="/static/images/google_logo_small.png" alt="Google logo" title="Google"></strong> project.
ru: <strong>HTML5 Rocks</strong> – это проект <strong><img src="/static/images/google_logo_small.png" alt="Google logo" title="Google"></strong>.

source: Contributions
ru: Участие

source: <strong>HTML5 Rocks</strong> is a <strong><img src="/static/images/google_logo_small.png" alt="Google"></strong> project.
ru: <strong>HTML5 Rocks</strong> – это проект <strong><img src="/static/images/google_logo_small.png" alt="Google"></strong>.

source: Contribute
ru: Внести вклад

source: This site and all of its tutorials and presentation slides are <a href="http://code.google.com/p/html5rocks/" rel="external">open source projects</a>. Tweak the code or <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">contribute</a> new guides!
ru: Этот сайт и все опубликованные руководства и слайды презентаций являются <a href="http://code.google.com/p/html5rocks/" rel="external">проектами с открытым кодом</a>. Вы можете внести в этот код изменения или <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">добавить</a> новые руководства.

source: Ready to develop in HTML5 but worried about supporting older versions of Internet Explorer? Learn how <a href="http://code.google.com/chrome/chromeframe/">Google Chrome Frame</a> can help. It's easy to include on your site:
ru: Готовы перейти на HTML5, но хотите обеспечить поддержку предыдущих версий Internet Explorer? Узнайте о преимуществах дополнения <a href="http://code.google.com/chrome/chromeframe/">Google Chrome Frame</a>. Добавить его на сайт очень просто: для этого выполните указанные ниже действия.

source: Reference
ru: Ссылка

source: Visual timeline of HTML5 feature support.
ru: Визуальная временная шкала поддержки функций HTML5.

source: Up to date HTML5 feature browser support reference.
ru: Сведения о текущем состоянии поддержки браузерами возможностей HTML5.

source: Series of browser tests to evaluate feature support.
ru: Серия тестов браузеров, позволяющих оценить уровень поддержки функций.

source: Follow the engineering effort for cutting edge support from the Chrome team.
ru: Узнайте о том, как технические специалисты команды Chrome обеспечивают поддержку пользователей на передовом уровне.

source: Opera's support for HTML5 standards
ru: Поддержка стандартов HTML5 в браузере Opera

source: If the Wikipedia says it then it must be true.
ru: Википедия обычно не ошибается.

source: Detailed table of ES5 support across browsers.
ru: Подробная таблица поддержки ES5 в различных браузерах.

source: Results of DOM and CSS properties tests in major browsers.
ru: Результаты тестирования свойств DOM и CSS в основных браузерах.

source: html5demos.com is a demo site with cross-browser demos.
ru: html5demos.com – это сайт, где собраны презентации для разных браузеров.

source: html5-demos.com is another demo site with cutting-edge demos and slide decks.
ru: html5-demos.com – еще один сайт, где вы найдете потрясающие презентации и примеры работ.

source: A guide to help developers build great web applications.
ru: Руководство для разработчиков по созданию успешных веб-приложений.

source: Documentation
ru: Документация

source: WHATWG HTML5 Spec, only author info preserved. Perfect for web developers.
ru: Спецификация WHATWG HTML5 – ничего, кроме информации об авторе. Идеальное решение для разработчиков.

source: Learn HTML5 and have a laugh at the same time.
ru: Увлекательное изучение возможностей HTML5.

source: Excellent WebKit-oriented development documentation.
ru: Отличная WebKit-ориентированная документация по разработке.

source: Excellent documentation and guides.
ru: Отличная документация и руководства.

source: Working draft spec of everything under the larger HTML5 umbrella.
ru: Рабочий проект спецификации всех аспектов HTML5.

source: Tools
ru: Инструменты

source: Javascript library for feature detection and control fallback cases of HTML5.
ru: Библиотека Javascript для определения возможностей и управления случаями восстановления HTML5.

source: Javascript patch to make IE support, and print, the new tag elements.
ru: Исправление Javascript, реализующее поддержку и печать новых элементов тегов в Internet Explorer.

source: An set of HTML/CSS/JS templates with best practices for HTML5 and front-end dev built in.
ru: Набор шаблонов HTML, CSS и JS с оптимальными алгоритмами для разработки кода HTML5 и внешнего интерфейса.

source: The collection of scripts that enable HTML5 features in all browsers.
ru: Набор скриптов, которые активируют функции HTML5 во всех браузерах.

source: Preview CSS buttons with a fancy interface to play with the parameters.
ru: Предварительный просмотр кнопок CSS с привлекательным интерфейсом для настройки параметров.

source: Test and get the code of the fanciest CSS features.
ru: Тестирование и загрузка кода, реализующего самые интересные возможности CSS.

source: Generate CSS code for gradients on the fly.
ru: Быстрое создание CSS-кода для градиентов.

source: Use CSS3 without having to worry about xbrowser differences.
ru: Используйте CSS3, не беспокоясь об отличиях xbrowser.

source: Test your fonts using drag and drop.
ru: Тестирование шрифтов с помощью перетаскивания.

source: Most complete tool to generate code for you font-face support.
ru: Самый полный инструмент создания кода для поддержки font-face.

source: Complete list of tools related to web performance.
ru: Полный список инструментов, связанных с производительностью веб-приложений.

source: Books
ru: Книги

source: Search Results
ru: Результаты поиска

source: Loading
ru: Загрузка

source: Videos and Presentations
ru: Видео и презентации

source: Slides, Presen&shy;ta&shy;tions & Videos
ru: Слайды, презентации и видео

source: Below you can get your hands on the most recent presentations by Google Chrome Developer Relations and friends. Video is shared if available and you can view them by person, topic or event.
ru: Ниже даны ссылки на новейшие презентации от группы поддержки разработчиков Google Chrome и наших друзей. Все опубликованные видео общедоступны. Кроме того, их можно отсортировать по авторам, темам или событиям.

source: Filter the talks to your liking
ru: Сортируйте обсуждения таким образом, чтобы читать только интересные вам.

source: filter by topic, person, etc
ru: фильтрация по темам, пользователям и т. д.

source: Only show talks more recent than:
ru: Показывать диалоги только после:

source: Loading...
ru: Загрузка...

source: Terms of Service
ru: Условия использования

source: HTML5 Rocks <span>Terms of Service</span>
ru: <span>Условия использования</span> HTML5 Rocks

source: The HTML5ROCKS website (the "Website") is hosted by Google. By using and/or visiting the Website, you consent to be bound by these terms of service as well as Google's general <a href="http://www.google.com/accounts/TOS">Terms of Service</a> and Google's general <a href="http://www.google.com/privacy.html">Privacy Policy</a>.
ru: Веб-сайт HTML5Rocks (далее Веб-сайт) размещен на серверах Google. Используя или посещая его, вы соглашаетесь с настоящими Условиями использования и общими <a href="http://www.google.com/accounts/TOS">Условиями предоставления услуг</a> Google, а также с общей <a href="http://www.google.com/privacy.html">Политикой конфиденциальности</a> Google.

source: Why HTML5 Rocks
ru: Почему HTML5 лучше?

source: Why HTML5 <span>Rocks</span>
ru: Почему HTML5 <span>лучше</span>?

source: HTML5 introduces many cutting-edge features that enable developers to create apps and websites with the functionality, speed, performance, and experience of desktop applications. But unlike desktop applications, apps built on the web platform can reach a much broader audience using a wider array of devices. HTML5 accelerates the pace of your innovation and enables you to seamlessly roll out your latest work to all your users simultaneously.
ru: В HTML5 представлено множество передовых функций, которые позволяют разработчикам создавать приложения и веб-сайты, сравнимые по функциональности, скорости работы, производительности и удобству использования с настольными приложениями. Но за счет большей инсталляционной базы приложения, созданные на веб-платформе, могут привлечь внимание значительно большей аудитории, в отличие от настольных программ. HTML5 ускоряет выпуск новых продуктов и позволяет предлагать их пользователям любых платформ, не прилагая лишних усилий.

source: Give me everything
ru: Расширенные возможности

source: Tutorials
ru: Руководства

source: Why move to HTML5 now than later?
ru: Почему лучше перейти на HTML5 именно сейчас?

source: Tools &amp; Frameworks
ru: Инструменты и платформы

source: Additional Resources
ru: Дополнительные ресурсы

source: Recent Contributors
ru: Авторы последних публикаций

source: More efficient connectivity means more real-time chats, faster games, and better communication. Web Sockets and Server-Sent Events are pushing (pun intended) data between client and server more efficiently than ever before.
ru: Более эффективное подключение устраняет задержки в чате, делает игры динамичнее и улучшает взаимодействие. А веб-сокеты и отправка событий с сервера позволяют доставлять данные к клиенту наиболее эффективным образом.

source: HTML5 agency Bocoup's deep research into EventSource
ru: Глубокое исследование API источников событий от компании Bocoup, которая использует HTML5

source: a hosted API for adding scalable realtime WebSockets functionality to your apps
ru: размещаемый API, который поможет добавить в веб-приложения масштабируемую функциональность веб-сокетов в реальном времени

source: The power of the EventSource API across browsers
ru: Эффективность API источников событий в различных браузерах

source: Feature
ru: Функция

source: What&rsquo;s New
ru: Новинки

source: loading&hellip;
ru: Загрузка&hellip;

source: IE
ru: Internet Explorer

source: Data courtesy of <a href="http://caniuse.com/">caniuse.com</a> and <a href="http://dev.chromium.org/developers/web-platform-status">Chrome Platform Status</a>.
ru: Данные предоставлены администрацией сайта <a href="http://caniuse.com/">caniuse.com</a> и сайта <a href="http://dev.chromium.org/developers/web-platform-status">статуса платформы Chrome</a>.

source: HTML5 provides very powerful APIs to interact with binary data and a user's local file system. The File APIs give web applications the ability to do things like read files [a]synchronously, create arbitrary Blobs, write files to a temporary location, recursively read a file directory, perform file drag and drop from the desktop to the browser, and upload binary data using <code>XMLHttpRequest2</code>.
ru: В пятой редакции языка появились чрезвычайно мощные API для взаимодействия с бинарными данными и локальной файловой системой пользователя. Помимо прочего, API для работы с файлами дает веб-приложениям возможность синхронно/асинхронно считывать файлы, создавать произвольные блобы, записывать файлы во временные каталоги, рекурсивно читать каталоги с файлами, перетаскивать файлы с рабочего стола в браузер, а также загружать бинарные данные с помощью <code>XMLHttpRequest2</code>.

source: As examples, the File APIs can be used to create a thumbnail preview of images as they're being sent to the server, or allow an app to save a file reference while the user is offline. Using the <a href="https://dvcs.w3.org/hg/audio/raw-file/tip/webaudio/specification.html">Web Audio API</a>, your app could read an .mp3 file and display a visualization of the song as it plays. Additionally, you could use client-side logic to verify an upload's mimetype matches its file extension or restrict the size of an upload.
ru: К примеру, используя API для работы с файлами, можно создавать уменьшенные копии изображений для предварительного просмотра при отправке на сервер или для того, чтобы разрешить приложению сохранять выборку справочной информации из файла, пока пользователь не в сети. Примените в своем приложении <a href="https://dvcs.w3.org/hg/audio/raw-file/tip/webaudio/specification.html">API для работы с аудиофайлами в Интернете</a>, чтобы воспроизводить файлы mp3 и визуализировать звуковую дорожку во время воспроизведения. В довершение к упомянутым средствам можно выполнять проверки на стороне клиента, чтобы подтвердить, совпадает ли mimetype загружаемого файла с его расширением, или ограничить размер загрузки.

source: This W3C specification defines the File APIs: <code>File</code>, <code>FileList</code>, <code>FileReader</code>, <code>Blob</code>.
ru: В этой спецификации W3C определяются API для работы с файлами: <code>API файлов</code>, <code>API списка файлов</code>, <code>API чтения файлов</code>, <code>API больших двоичных объектов</code>.

source: This W3C specification defines the FileSystem APIs; which provide an interface for reading and writing files and directories in a sandboxed file system.
ru: В этой спецификации W3C определяются API файловой системы для чтения и записи файлов и каталогов в тестовой среде файловой системы.

source: This W3C specification defines the FileWriter API; which provides an interface for writing to files from web applications.
ru: В этой спецификации W3C определяется API записи файлов – интерфейс для записи файлов из веб-приложений.

source: This W3C specification defines the ProgressEvent; which gives asynchronous updates on the progress of a File read.
ru: Эта спецификация W3C определяет объект ProgressEvent, который реализует асинхронное обновление сведений о ходе чтения файла.

source: This whatwg specification defines the native HTML5 drag and drop APIs
ru: Эта спецификация WHATWG определяет собственные API перетаскивания в HTML5

source: Tutorial on using Drag and Drop, FileAPI and XMLHttpRequest to upload files.
ru: Руководство по загрузке файлов с помощью перетаскивания, API файлов и XMLHttpRequest.
