Repository: html5rocks/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Techniques for Streaming Multimedia
ru: Техника потоковой передачи мультимедиа

source: Techniques for streaming content using various HTML5 APIs.
ru: Техника потоковой передачи мультимедиа с помощью API HTML5.

source: WebGL Transforms
ru: Преобразования WebGL

source: How 3D transforms work and how you can use them in WebGL.
ru: Принцип работы 3D-преобразований и их использование в WebGL.

source: Writing Augmented Reality Applications using JSARToolKit
ru: Создание приложений дополненной реальности с помощью JSARToolKit

source: Using the JSARToolKit library with WebRTC to build augmented reality applications in JavaScript.
ru: Создание приложений дополненной реальности на языке JavaScript с помощью библиотеки JSARToolKit с WebRTC.

source: Developing Game Audio with the Web Audio API
ru: Разработка звукового сопровождения для игр с помощью специального API

source: Varied intensity background music, overlapping sound effects and randomization, sound source and listener spatialization (and directional sound cones), room effects via convolution, detect and prevent clipping, and implement dynamics compression. Including interactive inline demos!
ru: Разная громкость фоновой музыки, наложение звуковых эффектов, воспроизведение в случайном порядке, ориентация в пространстве источника звука и слушателя (а также направленный звук), акустические эффекты помещения, определение и предотвращение искажений и динамическая компрессия. Все это с интерактивными презентациями!

source: Case Study: Building Technitone.com
ru: Пример использования: создание Technitone.com

source: How Technitone.com was built with the Web Audio API, WebGL, WebSockets, and a decent amount of magic.
ru: Как создавался сайт Technitone.com с помощью API веб-аудио, WebGL, WebSockets и пары-тройки секретных заклинаний.

source: Capturing Audio &amp; Video in HTML5
ru: Запись звука и видео в HTML5

source: How to capture audio and video using the navigator.getUserMedia() API.
ru: Инструкции по записи звука и видео с помощью API navigator.getUserMedia().

source: Case Study: Bouncy Mouse
ru: Пример использования: Bouncy Mouse

source: Bouncy Mouse is a slingshot platformer by Munkadoo Games. This article talks about porting the game to HTML5 and WebAudio.
ru: Bouncy Mouse – это динамичный платформер от Munkadoo Games. В статье обсуждается перенос этой игры в среду HTML5 и WebAudio.

source: Mixing Positional Audio and WebGL
ru: Сочетание возможностей технологии объемного звука и WebGL

source: How to use the positional audio features in Web Audio API with Three.js.
ru: Использование функций объемного звука в API веб-аудио с помощью скриптов Three.js.

source: WebGL Fundamentals
ru: Основы WebGL

source: Fundamentals of using WebGL as a 2D drawing API and using shaders for image processing.
ru: Основы применения WebGL в качестве API для создания двумерных рисунков, а также обработки изображений с использованием шейдеров.

source: Getting Started With the Track Element
ru: Начало работы с элементом отслеживания

source: The track element provides a simple, standardized way to add subtitles and captions to video and audio, but can also be used with other kinds of timed data, to improve searchability and enable deep linking.
ru: Элемент отслеживания – это удобное унифицированное средство добавления субтитров и подписей к видео- и аудиозаписям. Он используется и с другими хронометрированными данными, а также позволяет расширить возможности для поиска и создания внешних ссылок.

source: Google Photography Prize Gallery
ru: Галерея Google Фотоконкурса

source: Building the gallery widget for the Google Photography Prize site using Closure.
ru: Создание виджета галереи для сайта Google Фотоконкурса с помощью технологии Closure.

source: Animating a Million Letters Using Three.js
ru: Масштабные анимационные эффекты на базе скриптов Three.js

source: A guide to using shaders to animate large amounts of particles.
ru: Руководство по использованию шейдеров для создания анимационных эффектов с большим количеством объектов.

source: Case Study: Building the Stanis&#x0142;aw Lem Google doodle
ru: Пример использования: создание дудла "Станислав Лем"

source: A walk through of the HTML5 tech behind the Stanis&#x0142;aw Lem Google doodle.
ru: Подробное руководство по созданию дудла "Станислав Лем" с помощью технологии HTML5.

source: Migrating your WebSQL DB to IndexedDB
ru: Перенос БД WebSQL на платформу индексированной базы данных

source: A look at what it would take to port a WebSQL based application to IndexedDB.
ru: Обзор процедуры переноса приложения на базе WebSQL на платформу индексированной базы данных.

source: Using CORS
ru: Использование CORS

source: An introduction to Cross Origin Resource Sharing (CORS), which gives scripts the ability to make cross-origin XHRs.
ru: Введение в технологию обмена ресурсами с запросом происхождения (Cross Origin Resource Sharing, или CORS), которая позволяет создавать в скриптах объекты XHR с запросом происхождения.

source: The Synchronous FileSystem API for Workers
ru: Синхронный API файловой системы для объектов Web Worker

source: The HTML5 FileSystem API offers an synchronous version to be used in the context of Web Workers. The tutorial introduces the Synchronous API, and gives practical examples of using it.
ru: Синхронная версия API файловой системы в HTML5 предназначена для работы с объектами Web Worker. В этом руководстве описан синхронный API, а также приведены примеры его использования.

source: Getting Started with Web Audio API
ru: Начало работы с API веб-аудио

source: A gentle introduction to loading and playing, cross-fading, and filtering sound using the Web Audio API.
ru: Руководство для начинающих, в котором рассматривается загрузка, воспроизведение, а также реализация плавных переходов и фильтрации звука с помощью API веб-аудио.

source: HTML5 Techniques for Optimizing Mobile Performance
ru: Способы оптимизации мобильных приложений на базе HTML5

source: Learn the fundamentals of an HTML5 mobile framework. From network detection to sliding, flipping, and more.
ru: Основы работы с платформой HTML5 для мобильных устройств. В этой статье рассматриваются вопросы обнаружения сети, реализации плавного перемещения, отражения и многое другое.

source: Introduction to Rapha&euml;l.js
ru: Введение в Rapha&euml;l.js

source: Learn how to use Rapha&euml;l.js to create cross-platform SVG scenes.
ru: Узнайте, как создавать кросс-платформенные SVG-изображения с помощью скриптов Rapha&euml;l.js.

source: Measuring Page Load Speed with Navigation Timing
ru: Определение скорости загрузки страниц с помощью средств синхронизации навигации

source: Get accurate and detailed timing statistics-natively-for page navigation and load events.
ru: Руководство по использованию встроенных средств навигации по страницам и событий загрузки для получения точных и подробных статистических данных о времени.

source: Improving HTML5 Canvas Performance
ru: Оптимизация работы элемента canvas в HTML5

source: Ten tips to make your canvas applications and games faster. Every technique is backed up by a performance test.
ru: Десять советов, помогающих ускорить работу canvas-приложений и игр. Для каждого способа проведено тестирование производительности.

source: How Browsers Work: Behind the scenes of modern web browsers
ru: Принципы работы современных веб-браузеров

source: In this comprehensive primer, you will learn what happens in the browser between when you type google.com in the address bar until you see the Google page on the browser screen.
ru: В этом подробном руководстве объясняется, что происходит в браузере с момента ввода google.com в адресную строку до появления на экране страницы Google.

source: Integrating Canvas into your Web App
ru: Интеграция элемента canvas с веб-приложениями

source: Use the HTML5 canvas element to create, edit, open, export images and tips on how these techniques can be applied to an existing web application.
ru: Инструкции по применению элемента canvas в HTML5 для создания, изменения, открытия и экспорта изображений, а также советы, помогающие реализовать эти возможности в существующем веб-приложении.

source: Case Study: Auto-Resizing HTML5 Games
ru: Пример использования: автоматическое изменение размера в играх на HTML5

source: Resizing your game to fit a variety of form factors and window sizes.
ru: Изменение размеров игр для отображения в окнах разных форм и типов.

source: Simple Asset Management for HTML5 Games
ru: Удобные средства управления ресурсами в играх на HTML5

source: Centralize and manage the asset downloads for your HTML5 game.
ru: Централизованное управление загружаемыми ресурсами в играх на платформе HTML5.

source: Feature, Browser, and Form Factor Detection: It's Good for the Environment
ru: Определение компонентов, браузера и форм-фактора: настройка для конкретной среды

source: Tune your app to the environment it's running in using Feature Detection, Browser Detection, and Form Factor detection.
ru: Руководство по настройке приложения для конкретной среды выполнения с помощью функций обнаружения компонентов, браузера и форм-фактора.

source: HTML5 vs Native: The Mobile App Debate
ru: HTML5 и платформенные средства: альтернативные способы создания мобильных приложений

source: There are still compelling reasons to go native, and clearly, many developers are indeed going that route. This article is a debate on native versus web. We'll examine each point in favor of native, then we'll let the web come in and give its best defense.
ru: У программистов по-прежнему есть веские причины использовать ресурсы конкретных платформ, и многие разработчики идут по этому пути. В статье обсуждаются сильные стороны платформенных приложений, а затем рассматриваются преимущества веб-средств.

source: An Introduction to Shaders
ru: Введение в шейдеры

source: Want to learn about WebGL shaders but don't know where to start? I'm here to help!
ru: Руководство для начинающих по использованию шейдеров WebGL.

source: Getting Started with Three.js
ru: Начало работы со скриптами Three.js

source: Three.js is a powerful engine for doing native 3D work in your browser. But how do you get going?
ru: Three.js – эффективная платформа для обработки трехмерных объектов непосредственно в браузере. В этом руководстве объясняется, как приступить к ее использованию.

source: Making Forms Fabulous with HTML5
ru: Создание функциональных форм с помощью HTML5

source: Take advantage of improved forms support in HTML5 to build better forms, more easily.
ru: Расширенные возможности HTML5 позволяют создавать более эффективные формы, затратив меньше усилий.

source: Working Off the Grid with HTML5 Offline
ru: Работа в автономном режиме с помощью HTML5

source: This article covers practical techniques and examples for handling connectivity flakiness.
ru: В этой статье описаны способы работы в условиях нестабильного соединения и приведены соответствующие примеры.

source: Rendering HTML5 in older browsers with Google Chrome Frame
ru: Отображение страниц на HTML5 в старых версиях браузеров с помощью платформы Google Chrome Frame

source: HTML5 adds a multitude of new awesome tools to the web developer toolbox. Google Chrome Frame helps bringing these features to older browsers. This article will tell you how to use Chrome Frame on your site.
ru: HTML5 существенно расширяет возможности веб-разработчиков. Платформа Google Chrome Frame позволяет реализовать эти новые функции в старых версиях браузеров. В этой статье рассказывается, как использовать Chrome Frame на своем сайте.

source: New Tricks in XMLHttpRequest2
ru: XMLHttpRequest2: новые приемы

source: There has been a slew of improvements to our old friend <code>XMLHttpRequest</code> for working with different types of data. This tutorial covers the new hotness.
ru: Новая версия стандарта <code>XMLHttpRequest</code> содержит множество улучшений для работы с разными типами данных. В этом руководстве описываются новые возможности.

source: Chrome Experiments Demo Harness
ru: Демонстрационная программа для Chrome

source: Experiences from building a kiosk-style demo station with HTML and WebGL.
ru: Описание создания демонстрационной версии терминала самообслуживания на базе HTML и WebGL.

source: Image Filters with Canvas
ru: Фильтрация изображений с помощью элемента canvas

source: A quick guide to writing custom image filters with &lt;canvas&gt;.
ru: Краткое руководство по созданию персонализированных фильтров изображений с помощью элемента &lt;canvas&gt;.

source: This End Up: Using Device Orientation
ru: Определение и использование ориентации устройства

source: Learn how to use device orientation and device motion events to tell when your computer is moving.
ru: Узнайте, как зафиксировать движение компьютера с помощью событий, связанных с ориентацией и перемещением устройства.

source: Multi-touch Web Development
ru: Разработка мультисенсорных веб-приложений

source: Introduction on touch events for mobile devices.
ru: Введение в события сенсорного ввода на мобильных устройствах.

source: Case Study: Real-time Updates in Stream Congress
ru: Пример использования: динамические обновления в потоковом режиме

source: Choosing the right technology to accomplish real-time, asynchronous updates.
ru: Принципы выбора технологии для реализации асинхронных обновлений в режиме реального времени.

source: Case Study: Converting Wordico from Flash to HTML5
ru: Пример использования: перенос Wordico с платформы Flash на HTML5

source: Learn how we converted our <a href="https://chrome.google.com/webstore/detail/ehehfnkgbccpcjmfhdkbeakkpibbcfdl">Wordico</a> crossword game from Flash to HTML5.
ru: Узнайте, как мы перенесли нашу игру-кроссворд <a href="https://chrome.google.com/webstore/detail/ehehfnkgbccpcjmfhdkbeakkpibbcfdl">Wordico</a> с платформы Flash на HTML5.

source: "Mobifying" Your HTML5 Site
ru: Создание мобильной версии сайта на HTML5

source: A guide on how to create a mobile version of an existing HTML5 website. This study looks at what was required to make html5rocks.com friendly to mobile users.
ru: Руководство по созданию мобильной версии существующего веб-сайта HTML5. В нем рассматривается оптимизация сайта html5rocks.com для мобильных устройств.

source: Typographic effects in canvas
ru: Типографские эффекты в элементе canvas

source: Effects in canvas inner/outer shadows, neon-glows, reflections, space-age, pattern/gradient overlays, stereoscopic imaging, and other text/vector-effects...
ru: Эффекты в элементе canvas, внутренние и внешние тени, свечение, отражения, космические эффекты, наложения шаблонов и градиентов, стереоскопические изображения и другие текстовые и векторные возможности...

source: Improving the Performance of your HTML5 App
ru: Повышение производительности приложения HTML5

source: Optimization strategies and techniques for HTML5 applications.
ru: Стратегии и методы оптимизации приложений HTML5.

source: Case Study: Onslaught! Arena
ru: Пример использования: Onslaught! Arena

source: Learn how <a href="https://chrome.google.com/webstore/detail/khodnfbkbanejphecblcofbghjdgfaih">Onslaught! Arena</a> created their fast-paced, arcade-style medieval fantasy shoot 'em up.
ru: Узнайте, как разработчики <a href="https://chrome.google.com/webstore/detail/khodnfbkbanejphecblcofbghjdgfaih">Onslaught! Arena</a> создали динамичную трехмерную игру по средневековым мотивам.

source: No Tears Guide to HTML5 Games
ru: Полное руководство по играм HTML5

source: Building an HTML5 game using &lt;canvas&gt;, the no tears way.
ru: Создание игры на базе HTML5 с использованием элемента &lt;canvas&gt; без особых усилий.

source: Case Study: HTML5 MathBoard
ru: Пример использования: MathBoard на HTML5

source: A discussion on how the iPad's popular <a href="https://chrome.google.com/webstore/detail/elcilkmmbpmchojdmdohhoalmfmkcklk">MathBoard</a> application was ported to HTML5.
ru: Обсуждение переноса популярного приложения для iPad <a href="https://chrome.google.com/webstore/detail/elcilkmmbpmchojdmdohhoalmfmkcklk">MathBoard</a> на HTML5.

source: Case Study: Page Flip Effect from 20thingsilearned.com
ru: Пример использования: эффект отражения страницы от 20thingsilearned.com

source: Learn how to re-create the page flip effect found on <a href="http://www.20thingsilearned.com">20thingsilearned.com</a> using the Canvas API.
ru: Узнайте, как воссоздать эффект отражения страницы на сайте <a href="http://www.20thingsilearned.com">20thingsilearned.com</a> с помощью API canvas.

source: Exploring the FileSystem APIs
ru: Обзор различных API файловой системы

source: The FileSystem APIs give applications the ability to read/write files and directories in a secure, sandboxed file system on a user's local machine.
ru: API файловой системы позволяют приложениям считывать и записывать файлы и каталоги в безопасной тестовой среде файловой системы на локальном компьютере пользователя.

source: A Simple TODO list using HTML5 IndexedDB
ru: Простой список задач с использованием индексированной базы данных HTML5

source: IndexedDB represents the future of query-able client-side storage. This tutorial presents a real world application implementing the basics of the IndexedDB API.
ru: Индексированная база данных – технология будущего для хранения данных на стороне клиента с поддержкой запросов. В этом руководстве описано реальное приложение, в котором использованы основы API индексированной базы данных.

source: Case Study: Getting Entangled with HTML5 Canvas
ru: Пример использования: сложности при работе с элементом canvas в HTML5

source: Entanglement is a puzzle game made by Gopherwood Studios. This article talks about Entanglement's usage of the &lt;canvas&gt; tag.
ru: Entanglement – это игра-головоломка, созданная компанией Gopherwood Studios. В статье рассказывается об использовании в ней тега &lt;canvas&gt;.

source: Stream Updates with Server-Sent Events
ru: Потоковая передача обновлений путем отправки событий с сервера

source: The EventSource API is designed for receiving push notifications from a server, removing the need for client-size XHR polling.
ru: API EventSource предназначен для приема PUSH-оповещений с сервера, что устраняет необходимость в клиентском опросе XHR.

source: Introducing WebSockets: Bringing Sockets to the Web
ru: Представляем веб-сокеты: использование сокетов в Интернете

source: Learn how to use WebSockets to add low latency bidirectional client-server communication to your web app.
ru: Узнайте, как с помощью веб-сокетов создать в приложении двунаправленное соединение клиент–сервер с малым временем реакции.

source: Quick hits with the Flexible Box Model
ru: Быстрые переходы с моделью Flexible Box Model

source: An introduction to <q>flexbox</q>, an alternative <abbr title="Cascading Style Sheets">CSS</abbr> layout scheme based on vboxes and hboxes.
ru: Введение во <q>flexbox</q>, альтернативную схему компоновки <abbr title="Каскадные таблицы стилей">CSS</abbr> на основе элементов vbox и hbox.

source: Client-Side Storage
ru: Хранилище на стороне клиента

source: An overview of client-side storage techniques: Web Storage (local/session storage), Web SQL Database, Indexed Database, Filesystem.
ru: Обзор методов хранения данных на клиенте: веб-хранилище (локальное или в рамках сеансов), веб-база данных SQL, индексированная база данных, файловая система.

source: Native HTML5 Drag and Drop
ru: Встроенные функции перетаскивания в HTML5

source: Drag-and-drop is yet another first class citizen in HTML5! This article explains how to enhance your web applications by adding native DnD functionality.
ru: Перетаскивание – важнейшая возможность HTML5. В этой статье объясняется, как усовершенствовать веб-приложения, добавив в них встроенные функции перетаскивания.

source: Case Study: HTML5 in deviantART muro
ru: Пример использования: HTML5 в приложении deviantART muro

source: Learn how deviantART used HTML5 drawing features in deviantART muro.
ru: Узнайте, как компания deviantART использовала функции рисования в HTML5 при создании приложения deviantART muro.

source: Case Study: Drag and Drop Download in Chrome
ru: Пример использования: загрузка путем перетаскивания в Chrome

source: Learn how Box.net implemented GMail's attachment drag and drop to the desktop.
ru: Узнайте, как с помощью Box.net реализовано перетаскивание вложений Gmail на рабочий стол.

source: 3D and CSS
ru: 3D и CSS

source: Learn how to build exciting 3D user interfaces using the power of CSS.
ru: Узнайте, как создавать красивые трехмерные пользовательские интерфейсы с помощью CSS.

source: HTML5 Video
ru: Видео HTML5

source: Video is one of the most interesting and widely supported features of HTML5. This tutorial covers the mechanics of incorporating native video into your site (without a plugin) and gives interesting examples of using the &gt;video&lt; tag.
ru: Видео – одна из самых интересных и широко поддерживаемых функций HTML5. В этом руководстве рассматривается механизм внедрения собственного видео на сайт (без плагина), а также приведены интересные примеры использования тега &lt;video&gt;.

source: "Offline": What does it mean and why should I care?
ru: Автономный режим: что это такое и зачем он нужен?

source: A discussion of what it means to take an application "offline" and the options available to developers for doing so.
ru: Обсуждение термина "перевод приложения в автономный режим" и доступных разработчикам возможностей для такого перевода.

source: Quick guide to webfonts via @font-face
ru: Краткое руководство по веб-шрифтам и использованию элемента @font-face

source: Webfonts give new typographic freedom to designers while retaining scalability and accessibility.
ru: Веб-шрифты расширяют типографские возможности дизайнеров без ущерба для масштабирования и доступности.

source: Auditing Your Web App For Speed
ru: Проверка скорости работы веб-приложения

source: The Audit Panel is an excellent tool for examining latency in your web apps. It offers customized recommendations to enhance performance and reduce latency.
ru: Панель аудита – отличный инструмент для изучения времени реакции веб-приложений. В нем предлагаются индивидуальные рекомендации по повышению эффективности и уменьшению времени реакции.

source: The Basics of Web Workers
ru: Основные сведения об объектах Web Worker

source: Web Workers are a means of spawning background scripts in your application, giving thread-like message passing for handling computationally intensive tasks.
ru: Объекты Web Worker позволяют создавать в приложениях фоновые скрипты, реализующие потоковую передачу сообщений в задачах с интенсивными вычислениями.

source: Introduction to Chrome Developer Tools, Part One
ru: Введение в Инструменты разработчика Chrome, часть первая

source: An introduction to the tools available in Google Chrome that make a developer's life easier!
ru: Знакомство с инструментами для разработчиков в Google Chrome.

source: Best Practices for a Faster Web App with HTML5
ru: Оптимальные алгоритмы для создания быстрых веб-приложений на базе HTML5

source: How to effectively use features from HTML5 to improve the performance and responsiveness of your app.
ru: Эффективное использование функций HTML5 для повышения эффективности и скорости реакции приложения.

source: A Beginner's Guide to Using the Application Cache
ru: Руководство для начинающих по использованию кэша приложений

source: A step-by-step guide to taking your web app offline using the application cache APIs.
ru: Пошаговое руководство по переводу веб-приложения в автономный режим с помощью API кэша приложений.

source: Practical Guide to Take Your TODO List Offline
ru: Практическое руководство по переводу списка задач в автономный режим
